Repository: AKJUS/thunar
Catalog: po-doc/*.po
Languages: eu

source: Thunar File Manager
eu: Thunar Fitxategi Kudeatzailea

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.1 or any later version published by the Free Software Foundation; with no Invariant Sections, with no Front-Cover Texts, and with no Back-Cover Texts. The complete license text is available from the <ulink type="http" url="http://www.gnu.org/">Free Software Foundation</ulink>.
eu: Baimena ematen da dokumentu gau Free Software Foundation-en argitaratutako GNU Dokumentazio Libre Lizentziaren 1.1 bertsioak edo berriagoek ezarritako terminoetan kopiatu, zabaldu eta/edo eraldatzeko.Lizentzi testu osoa eskuragarri dago <ulink type="http" url="http://www.gnu.org/">Free Software Foundation</ulink> webgunean.

source: System development
eu: Sistema garapena

source: Software developer
eu: Software garatzailea

source: This manual describes version @PACKAGE_VERSION@ of @PACKAGE_NAME@.
eu: Manual honek @PACKAGE_NAME@ -ren @PACKAGE_VERSION@ bertsioa azaltzen du.

source: Introduction to @PACKAGE_NAME@
eu: @PACKAGE_NAME@ -ra sarrera

source: Thunar is a new modern file manager for the Xfce Desktop Environment. Thunar has been designed from the ground up to be fast and easy-to-use. Its user interface is clean and intuitive, and does not include any confusing or useless options by default. Thunar is fast and responsive with a good start up time and folder load time.
eu: Thunar Xfce Idazmahai Ingurunearen fitxategi kudeatzaile berria da. Thunar behe mailatik azkarra eta erabilerraza izateko diseinatua izan da. Bere erabiltzaile interfazea garbia eta intuitiboa da, eta ez du lehenespen bezala nahasi dezaketen edo erabilera urriko aukerarik. Thunar azkarra da eta erantzun bizkorra du bai abiaraztean bai karpetak kargatzeko denboran.

source: The Thunar file manager thereby provides an integrated access point to your files and applications. You can use the file manager to do the following:
eu: Thunar fitxategi kudeatzaileak zure fitxategi eta aplikazioetara sarrera integratu bat ematen du. Fitxategi kudeatzailea hurrengoa egiteko erabil dezakezu:

source: Create folders and documents.
eu: Karpeta eta dokumentuak sortu.

source: Display your files and folders.
eu: Zure fitxategi eta karpetak bistarazi.

source: Manage your files and folders.
eu: Zure fitxategi eta karpetak kudeatu.

source: Run and manage custom actions.
eu: Ekintza pertsonalizatuak abiarazi eta kudeatu.

source: Access Removable Media.
eu: Sarrera Gailu Aldagarria.

source: Advanced Topics
eu: Gomendio Aurreratuak

source: The UNIX File System
eu: UNIX Fitxategi Sistema

source: While the Thunar file manager does a good job at abstracting the details of the underlying file system, so the user does not need to care about them, it is sometimes useful to understand the basic concepts to get the whole picture. This section tries to give a brief introduction to the concepts of the UNIX file system, which is used today by all incarnations of UNIX, including Linux.
eu: Naiz Thunar fitxategi kudeatzaileak lan on bat egiten duenez fitxategi sistemaren xehetasunak abstraitzen, horrela erabiltzailea ez da hauetaz arduratu behar, batzuetan erabilgarri da oinarrizko kontzeptu ulertzea. Atal honek UNIX fitxategi sistemaren kontzeptuetara sarrera labur bat da, hau gaur egungo UNIX antzeko guztiek erabiltzen dutena LINUX barne.

source: Folders and Paths
eu: Karpetak eta Bideak

source: In a UNIX file system all folders are arranged in a simple inverted tree structure descending and branching down from a single top level folder, which is called the <emphasis>root directory</emphasis> (the term <emphasis>directory</emphasis> is often used instead of <emphasis>folder</emphasis>) and displayed as <guilabel>File System</guilabel> in Thunar. This means that you can get from any folder to any other by going up the tree until you reach a common point, then down the tree through the appropriate subfolders until you reach your target.
eu: UNIX fitxategi sistema batetan karpeta guztiak <emphasis>erro direktorioa</emphasis> hasten den alderantzizko zuhaitz estruktura batetan kokatzen dira (sarritan <emphasis>directorio</emphasis> terminoa <emphasis>karpeta</emphasis>-ren ordez erabiltzen da) eta thunar-en <guilabel>Fitxategi Sistema</guilabel> bezala bistaratzen dira. Honek karpeta batetik bestera mugitzeko batzen dituen puntu arte zuhaitzean gora igoaz eta gero helburu duzun karpetara sartuaz lor dezakezula.

source: The position of any file or folder in the tree can be described by its <emphasis>path</emphasis>. The path is the list of folders you would have to descend through to get to the target folder or file, starting from the top level folder. For example <filename role="directory">/home/luke</filename> is the subfolder <filename role="directory">luke</filename> of the subfolder <filename role="directory">home</filename> of the top level folder, and <filename>/home/luke/myfile.txt</filename> is the file <filename>myfile.txt</filename> in that subfolder. The leading <filename role="directory">/</filename> in these paths represents the top level folder.
eu: Zuhaitzean edozein karpeta edo fitxategiren kokalekua bere <emphasis>bidearen</emphasis> bidez azaldu daiteke. Bidea fitxategi edo karpeta horretara ailatzeko erro direktoriotik jaitsi behar diren karpeten izenek sortzen dute. Adibidez <filename role="directory">/home/luke</filename> <filename role="directory">home</filename> lehen mailako karpetaren <filename role="directory">luke</filename>azpidirektorioa da, eta <filename>/home/luke/myfile.txt</filename> karpeta honetako filename>myfile.txt</filename> fitxategiaren bidea da. bide hauetako <filename role="directory">/</filename> nagusiak erro mailako karpeta errepresentatzen du.

source: Every user has their own folder to hold their personal files and settings. This folder is called the <emphasis>home directory</emphasis> and is displayed in Thunar as special icon with the users login name. The folder is similar to the <guilabel>My Files</guilabel> folder known from Windows. The <emphasis>home directories</emphasis> of the various users in a system are usually located below the <filename role="directory">/home</filename> folder. For example <filename role="directory">/home/luke</filename> would be the home directory of the user with the login name <filename role="directory">luke</filename>, while <filename role="directory">/home/jane</filename> would be the home directory for the user with the login name <filename role="directory">jane</filename>.
eu: Erabiltzaile bakoitzak bere karpeta pertsonala du bere fitxategi eta ezarpen pertsonalak mantentzeko. Karpeta honi <emphasis>etxe direktorioa</emphasis> eta Thunar-en erabiltzaile izena et ikono berezi batez bistaratzen da. Karpeta hau Windows-eko <guilabel>Nire Dokumentuak</guilabel> karpetaren antzerakoa da.Erabiltzaile ezberdinen <emphasis>etxe direktorioak</emphasis> <filename role="directory">/home</filename> karpetaren barnean kokatzen dira. Adibidez <filename role="directory">/home/luke</filename> karpeta <filename role="directory">luke</filename> erabiltzailearen etxe direktorioa izan beharko litzateke eta <filename role="directory">/home/jane</filename> karpeta <filename role="directory">jane</filename> erabiltzailearen etxe direktorioa izan beharko litzateke.

source: File Types
eu: Fitxategi Motak

source: You may have already heard that everything is a file in UNIX. This is true for most objects present in UNIX systems today. In fact even devices are represented as a special files. While this may not make sense at first sight, it is one of the strengths of UNIX and its derivates, and has helped it to maintain a simple core over the years where other operating systems had to introduce new concepts for every new technology.
eu: Ziurrenik dagoeneko entzuna duzu UNIX sistemetan dena fitxategi bat dela. Hau UNIX sistematan dauden elementu gehienentzat egoa da. Praktikan gailuak ere fitxategi berezien bidez errepresentatzen dira. Nahiz honek hasiera batetan zentzurik ez duela iruditu UNIX eta aldagaien puntu indartsuenetako bat da eta beste sistema eragileek teknologia berri bakoitzagatik kontzeptu berriak sartu behar dituzten bitartean honek urteen zehar muin sinple bat mantentzen lagundu du.

source: These are the four most important types of files in the UNIX file system.
eu: Hauek dira UNIX fitxategi sistemako 4 fitxategi mota garrantzitsuenak.

source: Ordinary Files
eu: Fitxategiak Arruntak

source: An ordinary file may contain text, a program or other data. This includes image files, audio files, office documents and video files. The term <emphasis>file</emphasis> is often used to refer to an ordinary file.
eu: Fitxategi arrunt batek testua, programa bat edo beste datu batzuek izan ditzake, irudi fitxategiak, audio fitxategiak, ofizina dokumentuak eta bideo fitxategiak barne.<emphasis>Fitxategia</emphasis> terminoa fitxategi arruntez aritzeko erabiltzen da.

source: Folder Files
eu: Karpeta Fitxategiak

source: Folders are also files in the UNIX file system. To be exact a folder is a special file, which contains a mapping of file names to file references for every file contained within this folder.
eu: Karpetak ere fitxategiak dira UNIX sistemetan. Zehazki karpetak fitxategi bereziak dira zeinek karpeta horretako edozein fitxategiren fitxategi erreferentzien fitxategi izenen mapatze bat duen.

source: Symbolic Link Files
eu: Lotura Sinboliko Fitxategiak

source: A Symbolic link (often called a <emphasis>symlink</emphasis>) is a special file that contains a path to another file in the file system. Symbolic link files therefore do not contain any useful information themselves, but just refer to other files.
eu: Lotura sinbolikoa (baita <emphasis>symlink</emphasis> deiturikoak) fitxategi sistemako beste fitxategi batera bidea duen fitxategi berezi bat da. Lotura sinboliko fitxategiek beraz ez dute bere buruaren informazio erabilgarririk baina beste fitxategi batzuei egiten diote erreferentzia.

source: Device Files
eu: Gailu Fitxategiak

source: As mentioned earlier (most) devices are also accessed through the file system. These special device files are usually located in the <filename role="directory">/dev</filename> folder. For example the special file <filename>/dev/hda</filename> represents the first IDE disk on Linux.
eu: Lehen esan dugunez gailuak (gehienak) ere fitxategi sistemaren bidez eskuratzen dira. Fitxategi berezi hauek normalean <filename role="directory">/dev</filename> karpetan gordetzen dira. Adibidez <filename>/dev/hda</filename> fitxategi bereziak Linux-en lehenengo IDE diskoa adierazten du.

source: Frequently Asked Questions
eu: Sarri Egindako Galderak

source: The intent of this section is to collect the quite numerous frequently asked questions that relate to working with Thunar. If you know of a question that is missing from this page, please <ulink type="http" url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">file a request</ulink>.
eu: Atal honen helburua Thunar erabiltzaileen arten gehien egiten diren galderen bilduma egitea da. Hemen egon beharko zen eta ez dagoen galdera baten bat ezagutuaz gero , mesedez <ulink type="http" url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">eskaera bat</ulink> bete.

source: Why doesn't Thunar execute files marked as executable?
eu: Zergaitik Thunar-ek ez ditu abiarazgarri diren fitxategiak abiarazten?

source: For security reasons Thunar only executes files of type <literal>application/x-desktop</literal>, <literal>application/x-executable</literal> and <literal>application/x-shellscript</literal>. For desktop files the execution feature will only be enabled if the desktop file is of type <literal>Application</literal> and a valid <literal>Exec</literal> line is given or of type <literal>Link</literal> and a valid <literal>URL</literal> is given. For the other types the feature is available if the file is marked executable for the current user.
eu: Segurtasun arrazoiak medio Thunar-ek bakarrik <literal>application/x-desktop</literal>, <literal>application/x-executable</literal> eta <literal>application/x-shellscript</literal> motatako fitxategiak abiarazten ditu. Idazmahai fitxategien kasuan abiarazteko gaitasuna bakarrik <literal>Application</literal> motakoa eta baliozko <literal>Exec</literal> lerro bat duena edo <literal>Lotura</literal>motakoa eta baliozko <literal>URL</literal> bat ematean egongo da aktibaturik. Beste fitxategi motentzat gaitasun hau erabiltzaileak fitxategia abiarazgarri egin badu bakarrik aktibatuko da.

source: Also note that for <literal>application/x-executable</literal> and <literal>application/x-shellscript</literal>, the types of the file don't really need to match these types exactly, but it is suffice if the detected type has a parent that matches one of the two types listed above, or if the MIME-type is an alias for one of the above.
eu: Kontutan izan ere <literal>application/x-executable</literal> eta <literal>application/x-shellscript</literal> motentzat, fitxategi mota ez dela zehazki mota hauetako izan behar, baina aski da atzemandako motak goian zerrendaturiko bi motako baten azpi mota bat bada, edo MIME-mota bi horien ezizen bat bada.

source: Where does Thunar store the metadata associated with files?
eu: Non gordetzen ditu Thunar-ek fitxategiekin loturiko metadatak?

source: Thunar associates various settings with files/folders, which we call metadata. This metadata for all files is stored in tdb database file, which is called the metafile. The database file is stored in <filename>$XDG_CACHE_HOME/Thunar/metafile.tdb</filename> and can be examined using the <command>tdbtool</command>, which is part of the Thunar distribution (located in the <filename role="directory">tdb/</filename> subdirectory).
eu: Thunar-ek fitxategi/karpetekin zenbait ezarpen batzen ditu, honi metadata deitzen diogu. Fitxategi guztien metadata hau metafile izeneko tbd datubase batetan gordetzen dira. Datubase hau <filename>$XDG_CACHE_HOME/Thunar/metafile.tdb</filename>-en gordetzen da eta Thunar banaketaren zati den (<filename role="directory">tdb/</filename> azpidirektorioan kokatzen da)<command>tdbtool</command> erabiliaz ikusi daiteke.

source: Where does Thunar store its preferences?
eu: Non gordetzen ditu Thunar-ek bere hobespenak?

source: Thunar stores the user configurable preferences (and hidden settings) in an <filename>.ini</filename> file, which is located at <filename>$XDG_CONFIG_HOME/Thunar/thunarrc</filename> and can be examined using a text editor. See <filename>docs/README.thunarrc</filename> for an overview of the various preferences.
eu: Thunar-ek erabiltzaileak konfiguratu ditzaken ezarpenak (eta ezkutatze ezarpenak) <filename>$XDG_CONFIG_HOME/Thunar/thunarrc</filename> karpetako <filename>.ini</filename> fitxategi batetan gordetzen ditu eta testu editore bat erabiliaz ikusi daitezke. Irakurri <filename>docs/README.thunarrc</filename> hobespen ezberdinen ikuspegi bat eskuratzeko.

source: How to use mouse gestures in Thunar?
eu: Nola erabili sagu keinuak Thunar-en?

source: Thunar currently features basic support for so called <emphasis>mouse gestures</emphasis> in its icon view. You can use these <emphasis>mouse gestures</emphasis> by holding down the middle mouse button (usually the mouse wheel) while the mouse pointer is on the background area of the icon view component (any area that is not covered by an icon or a text). Now you can move the cursor into four directions to perform certain actions, which are described below.
eu: Thunar-en oinarrizko ezaugarriek <emphasis>sagu keinuak</emphasis> deitzen ditugunak onartzen ditu ikono ikuspegian. <emphasis>Sagu keinu</emphasis> hauek erabiltzeko saguaren markadorean ikono ikuspegiaren atzealdean (testu edo ikono bat ez dagoen edozein eremu) saguaren erdiko botoia (arruntean errubera) sakatua mantendu. Orain sagua mugitu dezakezu lau norabideetan behean zehazten diren zenbait ekintza egiteko.

source: Left
eu: Ezker

source: <placeholder-1/> - opens the previous visited folder
eu: <placeholder-1/> aurretik ikusitako karpeta irekitzen du

source: Up
eu: Gora

source: <placeholder-1/> - opens the parent folder
eu: <placeholder-1/> -guraso karpeta irekitzen du

source: Right
eu: Eskuinera

source: <placeholder-1/> - opens the next visited folder
eu: <placeholder-1/> - hurrengo ikusitako karpeta ireki

source: Down
eu: Behera

source: <placeholder-1/> - reloads the current folder
eu: <placeholder-1/> - uneko karpeta freskatu

source: How do I assign different keyboard shortcuts?
eu: Nola ezarri ditzaket lastertekla ezberdinak?

source: If you want to rebind a shortcut, Thunar supports the standard GTK+ way of changing shortcuts: simply hover over the menu option with the mouse pointer and press the keyboard shortcut you want to rebind it to.
eu: Lastertekla bat berrezarri nahiaz gero, Thunar-ek lasterteklak aldatzeko GTK+ modu estandarra onartzen du: sinpleki menu aukeraren gainean ipini sagu markatzailea eta sakatu berrezarri nahi duzun lastertekla.

source: To delete a keyboard assignment, press the <keycap>Backspace</keycap> key while you are on the menu entry.
eu: Teklatu ezarpen bat ezabatu nahiaz gero, sakatu <keycap>atzera-tekla</keycap> menu sarreran zaudenean.

source: If the shortcut doesn't change, then you need to enable the feature in GTK+. This can be achieved in 3 ways:
eu: Lastertekla ez balitz aldatuko, ezaugarri hau gaitu beharko duzu GTK+ -en. Hau hiru modu ezberdinetan egin daiteke:

source: If you are running Xfce 4.3 or above then you can enable <guilabel>Editable menu accelerators</guilabel> in the <guilabel>User Interface Preferences</guilabel> dialog.
eu: Xfce 4.3 edo berriago bat erabiltzen ari bazara <guilabel>Erabiltzaile Interfaze Hobespenetan</guilabel> <guilabel>Menu azeleradore editagarriak</guilabel> gaitu behar dituzu.

source: If you are running GNOME then you can enable <guilabel>Editable menu accelerators</guilabel> in the <guilabel>Menu and Toolbars</guilabel> control center dialog.
eu: Baldin eta GNOME erabiltzen baduzu <guilabel> Menu eta tersnabarra</guilabel> kontrol gune elkarrizketan <guilabel>Menu azeleradore editagarriak</guilabel> gaitu ditzakezu.

source: Otherwise put the following in your <filename>~/.gtkrc-2.0</filename> file (create the file if it doesn't exist):<screen>gtk-can-change-accels=1</screen>
eu: Bestela ipini hurrengo hau zure <filename>~/.gtkrc-2.0</filename> fitxategian (sortu ez balego):<screen>gtk-can-change-accels=1</screen>

source: Where does Thunar store the keyboard shortcuts?
eu: Non gordetzen ditu Thunar-ek teklatu laster-markak?

source: The custom keyboard shortcuts are stored in the standard GTK+ accel map format in a file located at <filename>$XDG_CONFIG_HOME/Thunar/accels.scm</filename>. Lines starting with <literal>;</literal> are comments. See the GTK+ documentation for details about the file format.
eu: Laster tekla pertsonalizatuak GTK+ azelearadore mapa formatu estandarrean <filename>$XDG_CONFIG_HOME/Thunar/accels.scm</filename> fitxategian gordetzen dira. <literal>;</literal>-ez hasten diren lerroak iruzkinak dira. Ikusi GTK+ dokumentazioa fitxategi formatuari buruzko xehetasunentzat.

source: If you are a packager or a system administrator and want to provide a system wide default for the keyboard shortcuts, that is different from the default shortcuts in Thunar, you can create a file <filename>Thunar/accels.scm</filename> in one of the <envar>$XDG_CONFIG_DIRS</envar>. For example, if <filename role="directory">/etc/xdg</filename> is part of <envar>$XDG_CONFIG_DIRS</envar> (the default for most Linux distributions), you can install system wide defaults to <filename>/etc/xdg/Thunar/accels.scm</filename>. Thunar will then load shortcuts from this file on first startup.
eu: Pakete sortzailea edo sistema kudeatzailea izan eta Thunar-en lehenetsiriko laster teklak ez diren beste batzuk erabili nahi izanez gero, <filename>Thunar/accels.scm</filename> fitxategia sortu dezakezu <envar>$XDG_CONFIG_DIRS</envar>-etako batetan. Adibidez, <filename role="directory">/etc/xdg</filename> direktorioa <envar>$XDG_CONFIG_DIRS</envar> zati bat da (lehenetsia banaketa gehienetan, sistema guztirako laster teklak <filename>/etc/xdg/Thunar/accels.scm</filename> fitxategian ezarri ditzakezu. Thunar-ek abiaraztean laster teklak fitxategi horretatik irakurriko ditu.

source: Support
eu: Lagundu

source: To report a bug or to make a suggestion regarding this application or this manual, use the bug tracking system at <ulink url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">http://bugzilla.xfce.org/</ulink>. Remember that useful bug reports are ones that get bugs fixed, so a useful bug report has two qualities:
eu: Aplikazio hau edo manual honi buruzko arazo baten berri eman edo gomendio bat egiteko <ulink url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">http://bugzilla.xfce.org/</ulink> arazo kudeaketa sistema erabili. Gogoratu arazo erreporte on bat konponbidea duena dela, beraz arazo erreporte on batek bi kualitate ditu:

source: <emphasis role="bold">Reproducible.</emphasis> If the developer cannot see the bug himself to prove that it exists, he will most probably not be able to fix it at all. Every detail you can provide helps.
eu: <emphasis role="bold">Errepikagarria.</emphasis> Garatzaileak ezin badu arazoa benetan dagoela ikusteko berau bere sisteman errepikatu, ziurrenik ez da arazo hori konpontzeko gai izango. Eman dezakezun edozein xehetasun erabilgarria izan daiteke.

source: <emphasis role="bold">Specific.</emphasis> The quicker the developer can isolate the problem to a specific area, the more likely he will expediently fix it.
eu: <emphasis role="bold">Zehatza.</emphasis> Garatzaileak arazoa eremu jakin batetan kokatzea errazteko, horrela ziurrenik konpontzeko gai izango da.

source: In case you want to request a new feature, please make clear why you consider it a worth addition for the application. It is more likely that a new feature gets added if you provide good arguments for the feature. It will increase the chance of addition even more if you provide a patch that implements the requested feature, but make sure that you read the file <ulink type="http" url="http://svn.xfce.org/svn/xfce/terminal/trunk/HACKING">HACKING</ulink> - especially the section labeled <emphasis>Coding Style</emphasis> - before you start hacking up the source.
eu: Ezaugarri berri bat eskatu nahi izanez gero, mesedez argi utzi zergatik zure ustez aplikaziora gehitu behar den. Gehitzeko eskatzean argumentu onak erabiliaz gero errazagoa izango da aurrerantzean ezaugarri hori gehitzea. Errazagoa izango da ere eskatutako ezaugarria gehitzen duen adabakia bidaltzen baduzu, baina ziurtatu zaitez <ulink type="http" url="http://svn.xfce.org/svn/xfce/terminal/trunk/HACKING">HACKING</ulink> dokumentua irakurri duzula bereiziki <emphasis>Kodeketa Estiloa</emphasis> atala - kodea hobetzen hasi aurretik.

source: Else, if you have questions about the use or installation of this software, please ask on the <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-dev mailing list</ulink> or point your IRC client to <emphasis role="bold">irc.freenode.net</emphasis>, join the channel <emphasis role="bold">#thunar</emphasis> and ask for help.
eu: Bestela, software hau instalatzeko edo erabiltzeko zalantzak izanez gero mesedez galde itzazu <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-devposta zerrendan</ulink> edo joan IRC bezeroan bitarteaz <emphasis role="bold">irc.freenode.net</emphasis> sareko <emphasis role="bold">#thunar</emphasis> gelara eta laguntza eskatu.

source: About @PACKAGE_NAME@
eu: @PACKAGE_NAME@ -ri buruz
