Repository: AKJUS/thunar
Catalog: po-doc/*.po
Languages: eu

source: @PACKAGE_NAME@ was written by Benedikt Meurer (<email>benny@xfce.org</email>). Visit the <ulink url="http://thunar.xfce.org/" type="http">Thunar website</ulink> for more information.
eu: @PACKAGE_NAME@ Benedikt Meurer-ek (<email>benny@xfce.org</email>) idatzia izan da. <ulink url="http://thunar.xfce.org/" type="http">Thunar webgunea</ulink> begiratu argibide gehiagorako.

source: This documentation was written by Benedikt Meurer (<email>benny@xfce.org</email>). The latest version of this document is always available from the <ulink type="http" url="http://thunar.xfce.org/">Thunar website</ulink>.
eu: Dokumentazio hau Benedikt Meurer-ek (<email>benny@xfce.org</email>) idatzia da. Dokumentu honen azken bertsioa beti<ulink type="http" url="http://thunar.xfce.org/">Thunar webgunean</ulink> dago eskuragarri.

source: This software is distributed under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
eu: Software hau Free Software Foundation-ek kaleratutako GNU Lizentzia Publiko Orokorraren baldintzetan zabaltzen da bai Lizentziaren 2 bertsioan, edo (zure aukeran) berriago den edozeinetan.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
eu: Programa honekin batera GNU Lizentzia Publiko Orokorraren kopia bat jasoko zenuen; hala ez bada, idatzi hona: Free SoftwareFoundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: translator-credits
eu: Piarres Beobide <pi@beobide.net> 2004, 2006.
