Repository: AKJUS/thunar
Catalog: docs/manual/po/*.po
Languages: ru

source: Thunar File Manager
ru: Файловый менеджер Thunar

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.1 or any later version published by the Free Software Foundation; with no Invariant Sections, with no Front-Cover Texts, and with no Back-Cover Texts. The complete license text is available from the <ulink type="http" url="http://www.gnu.org/">Free Software Foundation</ulink>.
ru: Разрешено копировать, распространять и/или модифицировать данный документ на условиях лицензии GNU Free Documentation License, версии 1.1 или более поздней версии, опубликованной Фондом Свободного ПО (Free Software Foundation). Документ не содержит неизменяемых разделов, не содержит текста, помещаемого на первую и последнюю страницу обложки. Полный текст лицензии доступен на сайте <ulink type="http" url="http://www.gnu.org/">Free Software Foundation</ulink>.

source: Software developer
ru: Разработчик ПО

source: System development
ru: Системная разработка

source: This manual describes version @PACKAGE_VERSION@ of @PACKAGE_NAME@.
ru: Данное руководство описывает @PACKAGE_NAME@ версии @PACKAGE_VERSION@.

source: Introduction to @PACKAGE_NAME@
ru: Введение в @PACKAGE_NAME@

source: Thunar is a new modern file manager for the Xfce Desktop Environment. Thunar has been designed from the ground up to be fast and easy-to-use. Its user interface is clean and intuitive, and does not include any confusing or useless options by default. Thunar is fast and responsive with a good start up time and folder load time.
ru: Thunar — это новый, современный файловый менеджер для рабочей среды Xfce. Thunar отличается быстротой работы и простотой использования. Его пользовательский интерфейс прост, интуитивно понятен и не содержит никаких путанных или бесполезных функций. Thunar быстро запускается и открывает папки.

source: The Thunar file manager thereby provides an integrated access point to your files and applications. You can use the file manager to do the following:
ru: Файловый менеджер Thunar является точкой доступа как к вашим файлам, так и к приложениям. Используя файловый менеджер вы можете:

source: Create folders and documents.
ru: Создавать папки и документы;

source: Display your files and folders.
ru: Просматривать ваши файлы и папки;

source: Manage your files and folders.
ru: Управлять вашими файлами и папками;

source: Run and manage custom actions.
ru: Настраивать и выполнять особые действия;

source: Access Removable Media.
ru: Получать доступ к съёмным носителям.

source: The File Manager Window
ru: Окно файлового менеджера

source: By default the file manager window consists of a shortcut pane on the left side, the main area on the right and a pathbar above the main area.
ru: Окно файлового менеджера состоит из боковой панели слева, основной области справа и панели адреса, расположенной над основной областью.

source: File Manager Window
ru: Окно файлового менеджера

source: The <guilabel>Shortcut Pane</guilabel> provides shortcuts to different folders on your system. The first shortcut will lead to your <emphasis>Home Folder</emphasis>, the folder you store all your personal data, and will therefore have the name of the current user. The second shortcut will take you to the trash bin, which stores deleted files that can be recovered later. The third shortcut takes you to the <emphasis>Desktop Folder</emphasis>, which contains the files and folders that are displayed on the desktop. The fourth shortcut will take you to the root of your file system - you may want to explore it a bit, even though it may be confusing to you if you are new to Linux/Unix. Just click on the different folders and see what is inside.
ru: На <guilabel>Боковой панели</guilabel> размещены закладки на различные папки вашей системы. Первая закладка указывает на вашу <emphasis>Домашнюю папку</emphasis>, в которой хранится вся персональная информация, поэтому она имеет имя вашего пользователя. Вторая закладка указывает на Корзину, в которой хранятся удалённые файлы. Эти файлы могут быть впоследствии восстановлены. Третья закладка указывает на папку <emphasis>Рабочий стол</emphasis>, в которой хранятся файлы, отображаемые на рабочем столе. Четвёртая закладка указывает на корневую файловую систему. Для новичка в Linux/Unix файловая система может показаться запутанной. Для исследования файловой системы просто пощёлкайте по различным папкам и просмотрите их содержимое.

source: Below the <emphasis>File System</emphasis> shortcut, the removable drives and media will be displayed. In the screenshot above, you can see a <guilabel>Floppy Drive</guilabel> shortcut. Click on these shortcuts to access the data stored on the removable drives and media. See <xref linkend="using-removable-media"/> for further details.
ru: Ниже закладки <emphasis>Файловая система</emphasis> показаны съёмные устройства и носители. На рисунке выше вы можете увидеть закладку <guilabel>Дисковод</guilabel>. Щёлкните на эту закладку для доступа к данным, хранящимся на съёмных устройствах и носителях. За дополнительной информацией обращайтесь к разделу <xref linkend="using-removable-media"/>.

source: The remaining shortcuts are user defined. Add your own shortcuts by simply dragging folders to the <guilabel>Shortcuts Pane</guilabel>. This will allow you to access important folders instantly. To remove a previously added shortcut, right-click on the shortcut and choose <guimenuitem>Remove Shortcut</guimenuitem>. To rename a previously added shortcut, right-click on the shortcut and choose <guimenuitem>Rename Shortcut</guimenuitem>. Note that these actions affect only the shortcut, not the folder referenced by the shortcuts.
ru: Остальные закладки ведут к папкам пользователя. Для добавления собственной закладки просто перетаскивайте папку на <guilabel>Боковую панель</guilabel>. Это позволит вам иметь удобный доступ к важным папкам. Для того, чтобы удалить ранее созданную закладку, щёлкните правой кнопкой мыши на закладке и выберите <guimenuitem>Удалить закладку</guimenuitem>. Для переименования закладки щёлкните по ней правой кнопкой мыши и выберите <guimenuitem>Переименовать закладку</guimenuitem>. Обратите внимание на то, что эти действия применяются только к самим закладкам и не влияют на папки, к которым ведут эти закладки.

source: The <emphasis>main area</emphasis> will always display the contents of the current folder. Double click on folders to enter them, and right-click on files or folders to get a context-menu offering some choices of what to do with it. Select multiple files by dragging a rectangle over them with the mouse. Alternatively, select one file, hold down the <keycap>Shift</keycap> key, and increase or decrease the selection using the arrow keys.
ru: <emphasis>Основная область</emphasis> отображает содержимое текущей папки. Для перехода в папку дважды щёлкните по ней. Щелчок правой кнопкой мыши на файлах или папках открывает контекстное меню, предлагающее варианты действий с ними. Для выделения группы файлов очертите с помощью мыши прямоугольник над ними. Существует и другой способ выделения: выделите один файл, затем, удерживая клавишу <keycap>Shift</keycap>, добавляйте или убавляйте выделенную область с помощью стрелок на клавиатуре.

source: The <emphasis>pathbar</emphasis> will always show the path you took to get to the folder you are currently at. You can click on any pathbar button to change to the folder it represents. Right-click on a pathbar button to bring up a context-menu with some options.
ru: <emphasis>Панель адреса</emphasis> всегда показывает путь к текущей папке. Вы можете щёлкнуть на любой кнопке панели адреса для перехода в соответствующую папку. Щелчок правой кнопкой мыши по кнопке на панели адреса откроет контекстное меню с различными вариантами действий.

source: Customizing the Appearance
ru: Настройка внешнего вида

source: There are many ways to customize the appearance of the file manager windows. In case you do not like the way the icons are displayed, choose <menuchoice><guimenu>View</guimenu><guimenuitem>View as Detailed List</guimenuitem></menuchoice> from the main menu to have the contents of the current folder displayed as a list.
ru: Существует множество настроек внешнего вида окна файлового менеджера. Если вам не нравится отображение файлов и папок в виде значков, выберите в основном меню <menuchoice><guimenu>Вид</guimenu><guimenuitem>Просмотр в виде подробного списка</guimenuitem></menuchoice>. Содержимое текущей папки отобразится в виде списка.

source: You can have the file manager windows display a location bar instead of the pathbar by choosing <menuchoice><guimenu>View</guimenu><guimenuitem>Location Selector</guimenuitem><guimenuitem>Toolbar Style</guimenuitem></menuchoice> from the main menu.
ru: Для отображения на панели адреса вместо ряда кнопок строки адреса, выберите в главном меню <menuchoice><guimenu>Вид</guimenu><guimenuitem>Панель адреса</guimenuitem><guimenuitem>Строка адреса</guimenuitem></menuchoice>.

source: In case you prefer a treeview in the left pane, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Side Pane</guimenuitem><guimenuitem>Tree</guimenuitem></menuchoice> from the main menu.
ru: Для отображения на боковой панели структуры файловой системы в виде дерева, выберите в главном меню <menuchoice><guimenu>Вид</guimenu><guimenuitem>Боковая панель</guimenuitem><guimenuitem>Дерево</guimenuitem></menuchoice>.

source: Visible Columns in the Detailed List View
ru: Отображаемые столбцы при просмотре в виде подробного списка

source: If you prefer to display the contents of the folder as a list, using the <guilabel>Detailed List View</guilabel>, you can customize the columns displayed in the list view. To customize the visible columns, choose <menuchoice><guimenu>View</guimenu><guimenuitem>Configure Columns...</guimenuitem></menuchoice> from the main menu.
ru: Если вы предпочитаете отображение содержимого папки в виде списка, используя <guilabel>Просмотр в виде подробного списка</guilabel>, то вы можете выбрать столбцы и порядок их отображения. Для того, чтобы настроить отображаемые столбцы, выберите в главном меню <menuchoice><guimenu>Вид</guimenu><guimenuitem>Настроить столбцы...</guimenuitem></menuchoice>.

source: Visible Columns
ru: Отображаемые столбцы

source: Select the columns you want to be displayed from the list of available columns. Click <guibutton>Move Up</guibutton> or <guibutton>Move Down</guibutton> to change the order of the columns. Click <guibutton>Use Default</guibutton> to revert your changes.
ru: Из списка доступных столбцов выберите те, которые должны отображаться. Щёлкните <guibutton>Переместить вверх</guibutton> или <guibutton>Переместить вниз</guibutton> для изменения порядка столбцов. Для отмены всех изменений нажмите <guibutton>Использовать по умолчанию</guibutton>.

source: Column Sizing
ru: Размеры столбцов

source: Select the option <guibutton>Automatically expand columns as needed</guibutton> if you want the list view columns to expand automatically if the needed to ensure the text is fully visible.
ru: Если вы хотите, чтобы столбцы автоматически расширялись так, чтобы текст был виден полностью, выберите опцию <guibutton>Автоматически увеличивать ширину столбцов</guibutton>.

source: Working with Files and Folders
ru: Работа с файлами и папками

source: Opening Files
ru: Открытие файлов

source: When you open a file, the file manager performs the default action for that file type. For example, opening a text file will display it in the default text editor, while opening an image file will display the image in the default image viewer.
ru: Когда вы открываете файл, файловый менеджер выполняет действие, заданное по умолчанию для данного типа файлов. Например, при открытии текстового файла, он откроется в текстовом редакторе, используемом по умолчанию, а при открытии изображения, оно откроется в программе по умолчанию для просмотра изображений.

source: The file manager checks the extension of a file to determine the type of a file. If the file has no known extension, the file manager examines the contents of the file.
ru: Для определения типа файла файловый менеджер проверяет его расширение. Если у файла неизвестное расширение, файловый менеджер пытается определить тип файла по содержимому.

source: Executing the Default Action
ru: Выполнение действия по умолчанию

source: To execute the default for a file, double-click on the file. For example, the default action for audio files is to play the it with the default music playing application. In this case, you can double-click on the file to open the file in the music player.
ru: Для выполнения действия по умолчанию просто сделайте двойной щелчок по файлу. Например, действие по умолчанию для аудио-файлов — воспроизвести их с помощью приложения по умолчанию для воспроизведения музыки. В этом случае вы можете сделать двойной щелчок по файлу для открытия его в музыкальном проигрывателе.

source: You can set <application>Thunar</application> preferences so that you click once on a file to execute the default action. For information, see <xref linkend="preferences-behavior"/>.
ru: Вы можете настроить <application>Thunar</application> на одиночный щелчок для выполнения действия по умолчанию. Более подробную информацию смотрите в разделе <xref linkend="preferences-behavior"/>.

source: Executing Non-Default Actions
ru: Выполнение нестандартных действий

source: To execute actions other than the default action for a file, select the file that you want to perform an action on. Choose the desired action from the <emphasis>Open With</emphasis> choices available in <guimenu>File</guimenu> menu or an <guimenu>Open With</guimenu> submenu.
ru: Для выполнении действия, отличающегося от действия по умолчанию, выберите файл, для которого вы хотите выполнить действие. Выберите желаемое действие из списка <emphasis>Открыть с помощью другого приложения...</emphasis>, находящегося в меню <guimenu>Файл</guimenu>, или в контекстном меню.

source: Adding Actions
ru: Добавление действий

source: To add actions associated with a file type, perform the following steps:
ru: Чтобы добавить действие для файлов определённого типа, выполните следующие шаги:

source: In the main area, select a file of the type to which you want to add an action.
ru: В основной области выберите файл того типа, для которого вы хотите добавить действие;

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Open With Other Application...</guimenuitem></menuchoice> from the main menu.
ru: В главном меню выберите <menuchoice><guimenu>Файл</guimenu><guimenuitem>Открыть с помощью другого приложения...</guimenuitem></menuchoice>;

source: Either choose an application in the <guilabel>Open With</guilabel> dialog or select <guibutton>Use a custom command</guibutton> and browse to the program with which you wish to open this type.
ru: Выберите приложение в диалоге <guilabel>Открыть с помощью</guilabel>, либо выберите <guibutton>Использовать команду</guibutton> и укажите программу, которой вы хотите открывать файлы этого типа.

source: The action you have chosen is now added to the list of actions for that particular file type. If you enabled the <guibutton>Use as default for this kind of file</guibutton> option or there was no prior action associated with the type, the newly added action is the default.
ru: Выбранное вами действие теперь добавлено в список действий для данного типа файлов. Если вы выбрали опцию <guibutton>Использовать эту программу для запуска этого типа файлов</guibutton>, или ранее не было действий, связанных с этим типом файлов, то добавленное действие станет действием по умолчанию.

source: You may also add actions using the <guibutton>Open With</guibutton> button under <menuchoice><guimenu>File</guimenu><guimenuitem>Properties...</guimenuitem></menuchoice>.
ru: Также вы можете добавить действия, используя кнопку <guibutton>Открывать с помощью</guibutton> в окне <menuchoice><guimenu>Файл</guimenu><guimenuitem>Свойства...</guimenuitem></menuchoice>.

source: Modifying Actions
ru: Изменение действий

source: To modify the actions associated with a file or file type, perform the following steps:
ru: Для изменения действий, связанных с файлом или типом файла, выполните следующие шаги:

source: In the main area, select a file of the type for which you want to modify the action.
ru: В основной области выберите файл того типа, для которого вы хотите изменить действие;

source: Choose <menuchoice><guimenu>File</guimenu><guimenuitem>Properties...</guimenuitem></menuchoice> from the main menu.
ru: В главном меню выберите <menuchoice><guimenu>Файл</guimenu><guimenuitem>Свойства...</guimenuitem></menuchoice>;

source: Select the new default action using the <guilabel>Open With</guilabel> button or add a new action by choosing <guimenuitem>Open With Other Application...</guimenuitem> from the drop down menu.
ru: Выберите новое действие по умолчанию, используя кнопку <guilabel>Открывать с помощью</guilabel>, либо добавьте новое действие, выбрав <guimenuitem>Открыть с помощью другого приложения...</guimenuitem> из контекстного меню.

source: To remove a previously added action for a file type, bring up the <guilabel>Open With</guilabel> dialog as described above, right-click the action you want to remove and choose <guimenuitem>Remove Launcher</guimenuitem>.
ru: Для удаления ранее добавленного действия для типа файла, откройте окно диалога <guilabel>Открыть с помощью</guilabel> как описано ранее, сделайте щелчок правой кнопкой мыши на действии, которое хотите удалить, и выберите <guimenuitem>Удалить значок запуска</guimenuitem>.

source: File Properties
ru: Свойства файла

source: The file properties window shows more information about any file or folder in the file manager. With this window, you can also do the following:
ru: Окно свойств файла показывает в файловом менеджере расширенную информацию о любом файле или папке. В этом окне также доступны следующие действия:

source: Change the icon for special files, such as application launchers and URL links.
ru: Изменение эмблемы для специальных файлов, таких как значки запуска приложений и ссылки URL;

source: Add or remove emblems for a file or folder.
ru: Добавление или удаление эмблем для файла или папки;

source: Change the UNIX file permissions for a file or folder.
ru: Изменение прав доступа UNIX для файла или папки;

source: Choose which application is used to open a file and other files of the same type.
ru: Выбор приложения для открытия файлов одного типа.

source: To open the file properties window, perform the following steps:
ru: Чтобы открыть окно свойств файла, выполните следующие шаги:

source: Select the file or folder whose properties you want to examine or change. You cannot select multiple items at once and display the properties that are in common to all items currently.
ru: Выделите файл или папку, свойства которой вы хотите просмотреть или изменить. В настоящее время вы не можете выделить сразу несколько объектов и просмотреть общие свойства для этих объектов;

source: Right-click the selected item and choose <guimenuitem>Properties...</guimenuitem> from the context menu.
ru: Щёлкните правой кнопкой мышки на выделенном объекте и выберите <guimenuitem>Свойства...</guimenuitem> из контекстного меню;

source: Press <keycombo><keycap>Alt</keycap><keycap>Return</keycap></keycombo>.
ru: Нажмите <keycombo><keycap>Alt</keycap><keycap>Enter</keycap></keycombo>.

source: Do one of the following: <placeholder-1/>
ru: Выполните одно из действий: <placeholder-1/>

source: Using Removable Media
ru: Использование съёмных носителей

source: Accessing Removable Media
ru: Доступ к съёмным носителям

source: Thunar supports removable media if it was built with support for <ulink type="http" url="http://freedesktop.org/wiki/Software_2fhal">HAL</ulink>, or if you are using <ulink type="http" url="http://www.freebsd.org/">FreeBSD</ulink>. Note however that on FreeBSD 6.0 or newer, it is suggested to use HAL rather than the native support provided by Thunar.
ru: Thunar поддерживает работу со съёмными носителями при условии, что он собран с поддержкой <ulink type="http" url="http://freedesktop.org/wiki/Software_2fhal">HAL</ulink> или, если вы используете <ulink type="http" url="http://www.freebsd.org/">FreeBSD</ulink>. Обратите внимание, что на FreeBSD 6.0 или новее рекомендуется использовать HAL, вместо встроенной в Thunar поддержки съёмных носителей.

source: To Mount Media
ru: Подключение носителя

source: To <emphasis>mount</emphasis> media is to make the file system of the media available for access. When you mount media, the file system of the media is attached as a subdirectory to your file system.
ru: <emphasis>Подключить</emphasis> носитель — означает сделать его файловую систему доступной для работы. Когда вы подключаете носитель, файловая система носителя присоединяется к вашей файловой системе в виде подкаталога.

source: To access media, insert the media in the appropriate device, or connect the new device to your computer (i.e. connect an USB stick to one of your USB ports). An object that represents the media is added to the side pane of the file manager. If <application>xfdesktop</application> is running and configured to display <guilabel>File/launcher icons</guilabel> this object will also be added to your desktop.
ru: Для получения доступа к носителю вставьте носитель в соответствующее устройство или подключите новое устройство к вашему компьютеру (например, подсоедините USB-накопитель к одному из USB портов). На боковую панель файлового менеджера добавится объект, соответствующий подключённому накопителю. При запущенном <application>xfdesktop</application>, в том случае, если для отображения выбран вариант <guilabel>Значки файлов или запуска</guilabel>, объект, соответствующий подключённому накопителю, появится и на рабочем столе.

source: To actually mount the media, click on the object that represents the media. For example, to mount a floppy diskette, click on the <guilabel>Floppy Drive</guilabel> object in the side pane. The file manager will now add the file system of the media to your file system hierarchy and display the contents of the floppy diskette in the main area.
ru: Чтобы подключить носитель, щёлкните на объекте, соответствующему носителю. Например, для подключения дискеты, щёлкните на объекте <guilabel>Дисковод</guilabel> на боковой панели. Файловый менеджер подключит файловую систему носителя к дереву каталогов системы и откроет содержимое дискеты в основном окне.

source: To Eject Media
ru: Извлечение носителя

source: If the drive for the media is a motorized drive (i.e. a CD-ROM drive), right-click on the media object in the side pane or on the desktop and choose <guilabel>Eject Volume</guilabel>. The media is ejected from the drive after a few seconds. If the drive for the media is not motorized (i.e. a floppy drive or an USB stick), right-click on the media object and choose <guilabel>Unmount Volume</guilabel>. After a short period of time, a notification will appear to inform you that it is now safe to remove the media or disconnect the drive from the computer.
ru: Если привод для носителя является механизированным (например, CD-ROM привод), то щёлкните по объекту, расположенному на боковой панели или на рабочем столе, правой кнопкой мыши и выберите <guilabel>Извлечь том</guilabel>. Носитель будет извлечён из устройства через несколько секунд. Если привод немеханизированный (например, дисковод или USB-накопитель), то щёлкните по объекту правой кнопкой мыши и выберите <guilabel>Извлечь том</guilabel>. Через короткое время появится сообщение о том, что вы можете безопасно отсоединить устройство от компьютера.

source: Unmount notification
ru: Сообщение об отключении
