Repository: AKJUS/thunar
Catalog: docs/manual/po/*.po
Languages: ru

source: Select this option to display emblems for folders in the side pane. You can assign emblems to folders in the <guilabel>Properties</guilabel> dialog. Select a folder in the main area and choose <menuchoice><guimenu>File</guimenu><guimenuitem>Properties...</guimenuitem></menuchoice> from the main menu, or right-click the folder and select <menuchoice><guimenuitem>Properties...</guimenuitem></menuchoice> from the context menu.
ru: Выберите эту опцию для отображения эмблем папок на боковой панели. Вы можете назначить эмблемы для папок в диалоговом окне <guilabel>Свойства</guilabel>. Выделите папку в основной области окна и выберите <menuchoice><guimenu>Файл</guimenu><guimenuitem>Свойства...</guimenuitem></menuchoice> в главном меню, или щёлкните правой кнопкой мыши на папке и выберите <menuchoice><guimenuitem>Свойства...</guimenuitem></menuchoice> из контекстного меню.

source: Behavior Preferences
ru: Настройки поведения

source: You can select the preferred behavior to interact with the file manager.
ru: В этой вкладке вы можете выбрать предпочитаемый способ взаимодействия с файловым менеджером.

source: Single click to active items
ru: Одиночный щелчок активирует объект

source: Select this option to perform the default action for an item when you click on the item. When this option is selected, and you point to an item, the title of the item is underlined and the item will be selected automatically after a short delay.
ru: Выберите эту опцию для того, чтобы действие по умолчанию выполнялось по одиночному щелчку на объекте. Когда выбрана эта опция, при наведении курсора на объект его название подчёркивается. Объект после короткой задержки автоматически выделяется.

source: This delay can be configured below the option. You can also disable the automatic selection of items by moving the selector to the left-most position.
ru: Длительность задержки может быть изменена ползунком. Также вы можете отключить автоматический выбор элемента, переместив ползунок в крайнее левое положение.

source: Double click to activate items
ru: Двойной щелчок активирует объект

source: Select this option to perform the default action for an item when you double click on the item, and select the item with a single click.
ru: Выберите эту опцию для того, чтобы действие по умолчанию выполнялось по двойному щелчку. Выбор объекта будет осуществляться по одиночному щелчку.

source: Advanced Preferences
ru: Дополнительные настройки

source: You can control advanced features of the file manager.
ru: Вы можете управлять дополнительными возможностями файлового менеджера.

source: Folder Permissions
ru: Права доступа к папке

source: Choose the action that should be performed when you change the permissions of a folder in the <guilabel>Properties</guilabel> dialog. You can choose to let <application>Thunar</application> ask everytime when you change folder permissions, tell it to default to applying the new permissions to the folder only or to apply them recursively to the folder contents as well.
ru: Выберите действие, которое должно быть выполнено при изменении вами прав доступа для папки в диалоговом окне <guilabel>Свойства</guilabel>. Вы можете выбрать следующие варианты: <application>Thunar</application> может выводить запрос каждый раз, когда вы изменяете права на папку; права могут применяться только к самой папке; права могут применяться рекурсивно к папке и ко всему её содержимому.

source: Volume Management
ru: Управление томами

source: If <application>Thunar</application> was installed with support for HAL and the <application>thunar-volman</application> package is also installed, you can enable the integrated volume manager. See <xref linkend="management-of-removable-drives-and-media"/> for details about this feature.
ru: Если установленный <application>Thunar</application> поддерживает HAL, а также установлен пакет <application>thunar-volman</application>, вы можете включить управление томами. Подробная информация об этой возможности находится в разделе <xref linkend="management-of-removable-drives-and-media"/>.

source: Customizing Thunar
ru: Настройка Thunar под свои нужды

source: This chapter describes how to customize certain parts of the file manager to your own needs.
ru: Этот раздел описывает, как настроить некоторые компоненты файлового менеджера под ваши нужды.

source: The "Send To" Menu
ru: Меню «Отправить в»

source: Thunar includes a <guilabel>Send To</guilabel> menu, which provides possible targets where files and folders can be sent to. To access the <guilabel>Send To</guilabel> menu, choose <menuchoice><guimenu>File</guimenu><guimenuitem>Send To</guimenuitem></menuchoice> from the main menu, or right-click on a file or folder and choose <menuchoice><guimenuitem>Send To</guimenuitem></menuchoice>.
ru: В Thunar есть меню <guilabel>Отправить в</guilabel>, в котором перечислены возможные цели, куда могут быть отправлены файлы и папки. Для доступа к меню <guilabel>Отправить в</guilabel> выберете <menuchoice><guimenu>Файл</guimenu><guimenuitem>Отправить в</guimenuitem></menuchoice> из главного меню или щёлкните правой кнопкой мышки на файле или папке и выберите <menuchoice><guimenuitem>Отправить в</guimenuitem></menuchoice>.

source: "Send To" Menu
ru: Меню «Отправить в»

source: By default, the <guilabel>Send To</guilabel> menu includes an entry named <guilabel>Desktop (Create Link)</guilabel> for all files and folders, which simply creates a link on the desktop for each selected file. In addition, if the <guilabel>Shortcuts Pane</guilabel> is active, the menu also includes an entry called <guilabel>Side Pane (Create Shortcut)</guilabel> for folders, which allows users to add new shortcuts to the side pane. Following these entries, <application>Thunar</application> lists the removable drives currently plugged into the computer. In the screenshot above, the <guilabel>Floppy Drive</guilabel> represents a possible target where files can be sent to. Note that the device is mounted automatically once selected from the <guilabel>Send To</guilabel> menu, so you do not need to manually mount it.
ru: По умолчанию для всех файлов и папок меню <guilabel>Отправить в</guilabel> содержит пункт под названием <guilabel>Рабочий стол (создать ссылку)</guilabel>. При этом просто создаётся ссылка на рабочем столе для каждого выбранного файла. Если <guilabel>Боковая панель</guilabel> отображается в виде закладок, меню также содержит для папок пункт <guilabel>Боковая панель (создать закладку)</guilabel>, что позволяет пользователям добавлять новые закладки на боковую панель. После этих пунктов <application>Thunar</application> отображает съёмные устройства, подключённые в данный момент к компьютеру. Например, на рисунке вверху в меню есть пункт <guilabel>Дисковод</guilabel>, предоставляющий возможность отправки на него файлов. Обратите внимание, что при выборе устройства в меню <guilabel>Отправить в</guilabel> оно подключается автоматически, поэтому вам не нужно подключать его вручную.

source: In addition <application>Thunar</application> also ships the <application>thunar-sendto-email</application> plugin, which adds the entry <guilabel>Mail Recipient</guilabel> to the menu, that opens the mail composer with the selected files attach to the new email. If the selection contains atleast one folder, the selected items are added to a ZIP archive before attaching them to the email. Otherwise, if the selection contains multiple files, or a single file, which is larger than 200Kib, the user will be prompted whether to pack the files into a ZIP archive, and send the ZIP archive.
ru: В состав <application>Thunar</application> также входит дополнение <application>thunar-sendto-email</application>, которое добавляет в меню пункт <guilabel>Электронная почта</guilabel>. Этот пункт запускает почтовую программу, а выбранные файлы присоединяется к новому письму в качестве вложения. Если выделена хотя бы одна папка, то все выделенные объекты перед прикреплением к письму будут добавлены в ZIP-архив. В остальных случаях, если выделены несколько файлов или один большой файл (более 200КБ), пользователю будет предложено упаковать файлы в архив ZIP и отправить этот архив.

source: Like most other features of <application>Thunar</application>, the <guilabel>Send to</guilabel> menu can be easily extended by users and application developers with new targets, using standard <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec">desktop entry files</ulink>. These files must be installed into one of the <filename role="directory">$XDG_DATA_DIRS/Thunar/sendto/</filename> folders (see the <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec">XDG Base Directory Specification</ulink> for details about the <literal>$XDG_DATA_DIRS</literal> variable).
ru: Как и большинство других функций <application>Thunar</application>, меню <guilabel>Отправить в</guilabel> может быть легко дополнено как пользователями так и разработчиками путём добавления новых пунктов с помощью стандартных <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fdesktop_2dentry_2dspec">файлов элементов рабочего стола</ulink>. Эти файлы должны быть установлены в одну из папок <filename role="directory">$XDG_DATA_DIRS/Thunar/sendto/</filename> (описание переменной <literal>$XDG_DATA_DIRS</literal> смотрите в спецификации <ulink type="http" url="http://freedesktop.org/wiki/Standards_2fbasedir_2dspec">XDG Base Directory Specification</ulink>).

source: The <literal>MimeType</literal> of the target <filename>.desktop</filename> specifies the types of files for which this action should be available in the <guilabel>Send To</guilabel> menu. For example, say you want to add entry for a <ulink type="http" url="http://flickr.com/">Flickr</ulink> uploader tool, then this entry should only show up if the selection contains JPEG files (other file formats are not supported by Flickr) and so you should add a line <literal>MimeType=image/jpeg;</literal>. If you do not specify any <literal>MimeType</literal> your entry will show up for all file types.
ru: <literal>MimeType</literal>, указанный в файле <filename>.desktop</filename> для нового пункта меню <guilabel>Отправить в</guilabel>, задаёт типы файлов, для которых будет доступен данный пункт меню. Например, вы хотите добавить пункт меню для инструмента загрузки на <ulink type="http" url="http://flickr.com/">Flickr</ulink>. Соответствующий пункт должен отображаться только при выборе JPEG-файлов (Flickr поддерживает только этот формат). Значит вы должны добавить строку <literal>MimeType=image/jpeg;</literal>. Если вы не укажете <literal>MimeType</literal>, ваш пункт будет отображаться для всех типов файлов.

source: A complete example using the <application>postr</application> application is shown below:
ru: Ниже приведён законченный пример, использующий приложение <application>postr</application>:

source: # postr.desktop - Integrate postr into # the "Send To" menu. [Desktop Entry] Type=Application Version=1.0 Encoding=UTF-8 TryExec=postr Exec=postr %F Icon=postr Name=Flickr MimeType=image/jpeg;
ru: # postr.desktop - Добавление postr в # меню "Отправить в". [Desktop Entry] Type=Application Version=1.0 Encoding=UTF-8 TryExec=postr Exec=postr %F Icon=postr Name=Flickr MimeType=image/jpeg;

source: If you install this file to <filename role="directory">~/.local/share/Thunar/sendto/</filename> (create the folder if it does not exist yet), the <guilabel>Send To</guilabel> menu for JPEG files will show the new entry <guilabel>Flickr</guilabel>, which can be used to upload JPEG images to Flickr.
ru: Если вы поместите этот файл в папку <filename role="directory">~/.local/share/Thunar/sendto/</filename> (создайте папку, если она не существует), меню <guilabel>Отправить в</guilabel> для JPEG файлов будет содержать новый пункт <guilabel>Flickr</guilabel>, который можно использовать для загрузки JPEG изображений на Flickr.

source: The <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/sendto_menu">Thunar Project Wiki</ulink> contains additional examples of useful targets for the <guilabel>Send To</guilabel> menu. Feel free to extend the Wiki page with new examples.
ru: На <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/sendto_menu">wiki проекта Thunar</ulink> содержатся другие примеры для меню <guilabel>Отправить в</guilabel>. Вы можете дополнить wiki своими примерами.

source: Thumbnailers
ru: Утилиты создания образцов файлов

source: Thunar uses small utilities to create thumbnails of certain file types and displays the thumbnails as preview of the file content. These small tools are called thumbnailers. Thunar ships with thumbnailers for image and font files, and makes use of the installed thumbnailers from GNOME automatically if it was installed with support for <literal>gconf</literal>. Users may however dynamically extend this basic functionality with thumbnailers for additional file types.
ru: Thunar использует небольшие утилиты для создания образцов некоторых типов файлов. Образцы представляют собой небольшие изображения, иллюстрирующие содержимое файла, и используются для предварительного просмотра файлов. Инструменты для их создания называются утилитами создания образцов. В Thunar уже включены утилиты создания образцов файлов изображений и шрифтов. Кроме того, если Thunar был установлен с поддержкой <literal>gconf</literal>, он автоматически использует установленные утилиты создания образцов для GNOME. Пользователи могут самостоятельно расширить базовую функциональность Thunar, добавив утилиты создания образцов для дополнительных типов файлов.

source: If you plan to write a custom thumbnailers, you need to start with a program that accepts atleast two command line parameters, the input file, which is of the file type you plan to support and the output file, which is a PNG file that complies with the format specified by the <ulink type="http" url="http://jens.triq.net/thumbnail-spec/creation.html#AEN139">Thumbnail Management Standard</ulink>. Additionally your program may also accept the desired size of the thumbnail, which is optional but highly recommended. If you write the output file at an arbitrary image size, Thunar will afterwards scale it to the desired size, which might produce a less optimal result than generating the thumbnail with the requested dimensions.
ru: Если вы планируете разработать собственную утилиту создания образцов файлов, то вам надо начать с программы, которая принимает как минимум два аргумента командной строки: входной файл одного из поддерживаемых типов и выходной файл PNG, соответствующий формату, описанному в спецификации <ulink type="http" url="http://jens.triq.net/thumbnail-spec/creation.html#AEN139">Thumbnail Management Standard</ulink>. Хотя это и не обязательно, в программе рекомендуется предусмотреть возможность работы с образцами желаемых размеров. Если вы запишите выходной файл с произвольно выбранным размером изображения, Thunar впоследствии изменит масштаб до желаемого размера. Результат при этом будет хуже по сравнению с первоначальным созданием образца нужного размера.

source: Once your utility to generate the thumbnails is done, you will need to register your thumbnailer, so Thunar is able to locate and use it. Therefore all you need to do is to install a description file for the thumbnailer (a <filename>.desktop</filename> file) in one of the <filename role="directory">$XDG_DATA_DIRS/thumbnailers/</filename> paths. For example, if you want to register the thumbnailer for your user account only, you can install the file into the folder <filename role="directory">~/.local/share/thumbnailers/</filename>. The <filename>.desktop</filename> for thumbnailers has the following format.
ru: После того как ваша утилита для создания образцов готова, вам необходимо её зарегистрировать, чтобы Thunar мог её найти и использовать. Всё, что вам нужно сделать, это разместить файл описания для утилиты создания образцов (файл <filename>.desktop</filename>) в подкаталоге <filename role="directory">$XDG_DATA_DIRS/thumbnailers/</filename>. Например, если вы хотите зарегистрировать утилиту только для вашей учётной записи пользователя, вы можете поместить файл в каталог <filename role="directory">~/.local/share/thumbnailers/</filename>. Файл <filename>.desktop</filename> для утилит создания образцов имеет следующий формат.

source: Thumbnailer Description File Format
ru: Формат файла описания утилиты создания образцов

source: Thumbnailer description files utilize the <ulink type="http" url="http://standards.freedesktop.org/desktop-entry-spec/latest/">Desktop Entry Format</ulink> with a special <literal>Type</literal> of <literal>X-Thumbnailer</literal> and special field <literal>X-Thumbnailer-Exec</literal> with new field codes. Basically, a thumbnailer description file has the following format.
ru: Файл описания утилиты использует стандарт <ulink type="http" url="http://standards.freedesktop.org/desktop-entry-spec/latest/">Desktop Entry Format</ulink> со специальным типом <literal>X-Thumbnailer</literal> и специальным полем <literal>X-Thumbnailer-Exec</literal>. Обычно файл описания утилиты имеет следующий формат:

source: The <literal>Version</literal> and <literal>Encoding</literal> are mandated by the Desktop Entry Specification, just use the values shown in the example above. The <literal>Type</literal> field must have the special value <literal>X-Thumbnailer</literal>, otherwise your thumbnailer will not be recognized. The <literal>Name</literal> value describes your thumbnailer.
ru: Поля <literal>Version</literal> и <literal>Encoding</literal> описаны в Desktop Entry Specification. Просто используйте значения из примера выше. Поле <literal>Type</literal> должно иметь специальное значение <literal>X-Thumbnailer</literal>, иначе ваша утилита создания образца не будет распознана. В поле <literal>Name</literal> указывается описание вашей утилиты создания образцов.

source: The <literal>X-Thumbnailer-Exec</literal> field contains the command to run your thumbnailer, and supports certain field codes that will be substituted when the thumbnailer is run. Recognized field codes are as follows:
ru: Поле <literal>X-Thumbnailer-Exec</literal> содержит команду для запуска вашей утилиты создания образцов и поддерживает некоторые коды полей, заменяемые при запуске утилиты. Поддерживаемые коды полей:

source: The local path to the input file for which to create a thumbnail. May be either a path relative to the directory from which the thumbnailer was invoked or an absolute path.
ru: Локальный путь к входному файлу, для которого создаётся образец. Может быть как относительным путём от каталога, из которого была вызвана утилита создания образцов, так и абсолютным путём.

source: The local path to the output file where to store the generated thumbnail. The output file must be written as valid PNG file according to the thumbnail standard (see above). Note that the path may not end with <literal>.png</literal>, which matters if you invoke certain third party tools.
ru: Локальный путь к выходному файлу для хранения созданного образца. Выходной файл должен быть корректным файлом PNG в соответствии со стандартом (см. выше). Обратите внимание, что путь может и не содержать в конце <literal>.png</literal>, что важно при вызове некоторых сторонних утилит.

source: The desired size of the generated thumbnail in pixels. This parameter is optional.
ru: Желаемый размер создаваемого образца в пикселях. Этот параметр необязателен.

source: Similar to <literal>%i</literal>, but substituted with the URI of the file, rather than the path. This was added for compatibility with GNOME.
ru: Похож на <literal>%i</literal>, но заменяется на URI (унифицированный идентификатор ресурса) файла, а не на путь к файлу. Был добавлен для совместимости с GNOME.

source: Will be substituted with a single <literal>%</literal>.
ru: Будет заменён одиночным символом <literal>%</literal>.

source: You need to include atleast <literal>%o</literal> and <literal>%i</literal> or <literal>%u</literal>, otherwise your thumbnailer will be useless.
ru: Вам необходимо использовать по крайней мере <literal>%o</literal> и <literal>%i</literal> или <literal>%u</literal>, иначе ваша утилита создания образцов будет бесполезна.

source: The <literal>MimeType</literal> lists the MIME types - separated by semicolon - for which your thumbnailer is able to create previews.
ru: В <literal>MimeType</literal> через точку с запятой перечисляются MIME-типы, для которых ваша утилита может создавать образцы для предварительного просмотра.

source: Example EPS Thumbnailer
ru: Пример утилиты создания образцов для EPS-файлов

source: This example demonstrates how to write and install a new thumbnailer for <filename>.eps</filename> files, which uses the <command>convert</command> utility that ships as part of ImageMagick. First, we start with a simple script that invokes <command>convert</command> to generate a thumbnail at the requested size.
ru: Этот пример демонстрирует, как написать и установить новую утилиту создания образцов для файлов <filename>.eps</filename>. Эта утилита использует программу <command>convert</command>, входящую в состав ImageMagick. Сначала напишем простой скрипт, вызывающий <command>convert</command> для создания образца требуемого размера.

source: Save this script above to a file <filename>eps-thumbnailer</filename>, make sure the file is executable and install it to <filename role="directory">/usr/local/bin</filename>.
ru: Сохраните этот скрипт в файл с именем <filename>eps-thumbnailer</filename>. Убедитесь, что файл исполняемый и поместите его в папку <filename role="directory">/usr/local/bin</filename>.

source: Next we need to create the thumbnail description file <filename>eps-thumbnailer.desktop</filename>, which looks like this:
ru: Далее нам нужно создать файл описания этой утилиты <filename>eps-thumbnailer.desktop</filename>, который будет выглядеть примерно следующим образом:

source: This file must be installed to <filename role="directory">/usr/local/share/thumbnailers</filename> (create the folder if it does not exists).
ru: Этот файл надо поместить в папку <filename role="directory">/usr/local/share/thumbnailers</filename> (если такой папки нет, создайте её).

source: The <filename>eps-thumbnailer.desktop</filename> file uses the special key <literal>TryExec</literal>, which, if specified, names a command that must be present on the system for the thumbnailer to be useful. In this case, our script is useless if the <command>convert</command> utility is not present.
ru: В файле <filename>eps-thumbnailer.desktop</filename> может использоваться специальный ключ <literal>TryExec</literal>. В случае присутствия ключа, в нём должна быть указана утилита создания образцов, присутствующая в системе. Таким образом, если утилита <command>convert</command> не установлена, наш скрипт бесполезен.
