Repository: AKJUS/thunar
Catalog: docs/manual/po/*.po
Languages: ru

source: The last step is to regenerate the thumbnailer cache, so Thunar will pick up our thumbnailer. The thumbnailer cache is located at <filename>$XDG_CACHE_HOME/Thunar/thumbnailers.cache</filename> (unless overridden by your or your system administrator, the <varname>$XDG_CACHE_HOME</varname> points to the folder <filename role="directory">~/.cache/</filename>). The thumbnailers cache is regenerated periodically by Thunar, but you can force to regenerate it by invoking the <filename>thunar-vfs-update-thumbnailers-cache-1</filename> utility, that ships as part of Thunar. This utility is usually installed in the <filename role="directory">libexec</filename> subfolder of your installation prefix (<filename role="directory">sbin</filename> on Debian/Ubuntu). So for example, if Thunar is installed in <filename role="directory">/usr</filename>, invoke the utility as follows:
ru: Последним шагом является обновление кэша утилит создания образцов, для чего Thunar вызывает вашу утилиту создания образцов. Кэш находится в <filename>$XDG_CACHE_HOME/Thunar/thumbnailers.cache</filename> (по умолчанию <varname>$XDG_CACHE_HOME</varname> указывает на папку <filename role="directory">~/.cache/</filename>, если вы или ваш системный администратор не меняли эту переменную). Thunar периодически обновляет кэш, но вы можете и самостоятельно обновить его принудительно, запустив утилиту <filename>thunar-vfs-update-thumbnailers-cache-1</filename>, входящую в поставку Thunar. Эта утилита обычно устанавливается в подпапку <filename role="directory">libexec</filename> префикса вашей установки (<filename role="directory">sbin</filename> в Debian/Ubuntu). Например, если Thunar установлен в<filename role="directory">/usr</filename>, тогда утилиту можно вызвать следующим образом:

source: But make sure you run the program from your user account, not the superuser account, since the thumbnailers cache is stored in your home folder, rather than a system wide location.
ru: Удостоверьтесь, что вы запускаете программу из вашей учётной записи пользователя, а не как суперпользователь, так как кэш утилит хранится в вашем домашнем каталоге, а не в общесистемном.

source: Now, if Thunar is compiled with support for file alteration monitoring (using the FAM or Gamin services), it will automatically pick up the new thumbnailers cache within a few seconds and afterwards be able to generate thumbnails using your custom thumbnailers. Otherwise you might need to completely restart Thunar to apply the changes, using
ru: Если Thunar был скомпилирован с поддержкой мониторинга изменения файлов (с использованием сервисов FAM или Gamin), он за несколько секунд заберёт новый кэш утилит создания образцов и после этого сможет создавать образцы с помощью ваших пользовательских утилит. В противном случае вам понадобится полностью перезапустить Thunar командой

source: to terminate any running instance, and afterwards restart it from your launcher.
ru: для завершения всех запущенных экземпляров. После чего запустите его стандартным способом.

source: Cleaning up Thumbnails
ru: Очистка кэша образцов

source: The generated thumbnails are stored in the folder <filename role="directory">~/.thumbnails/</filename> complying with the <ulink type="http" url="http://jens.triq.net/thumbnail-spec/index.html">Thumbnail Management Standard</ulink>. While testing a new thumbnailer, it might help to clean up the thumbnail cache using
ru: В соответствии со спецификацией <ulink type="http" url="http://jens.triq.net/thumbnail-spec/index.html">Thumbnail Management Standard</ulink> созданные образцы хранятся в папке <filename role="directory">~/.thumbnails/</filename>. В процессе тестирования новой утилиты вам может понадобиться очистить кэш образцов командой

source: which will also give you some free space in your home folder. Since all the information stored within this folder was automatically generated from files in your file system, you will not loose any sensitive data.
ru: которая освободит место в вашей домашней папке. Так как вся информация, хранящаяся в папке <filename role="directory">~/.thumbnails/</filename>, создана автоматически на основании файлов в вашей файловой системе, вы не потеряете никаких важных данных.

source: Advanced Topics
ru: Дополнительная информация

source: To Bulk Rename Files
ru: Массовое переименование файлов

source: To <emphasis>bulk rename</emphasis> files means to rename multiple files at once using some criterion, that applies to atleast one of the files. <application>Thunar</application> includes a bulk renamer, which can be run separately using the command <command>Thunar -B</command> or from within <application>Thunar</application> by selecting two or more files in the main area and pressing <keycombo><keycap>F2</keycap></keycombo> or choosing <menuchoice><guimenu>Edit</guimenu><guimenuitem>Rename...</guimenuitem></menuchoice> from the main menu.
ru: <emphasis>Массовое переименование</emphasis> файлов означает переименование сразу нескольких файлов, основанное на каком-то критерии, применимом как минимум к одному из файлов. <application>Thunar</application> включает в себя утилиту массового переименования, которую можно запустить отдельно командой <command>Thunar -B</command> или непосредственно из <application>Thunar</application>. Также она запускается из <application>Thunar</application> при выделении двух или более файлов в основной области окна и нажатии <keycombo><keycap>F2</keycap></keycombo> или выборе <menuchoice><guimenu>Правка</guimenu><guimenuitem>Переименовать...</guimenuitem></menuchoice> в главном меню.

source: Bulk Rename Files
ru: Массовое переименование файлов

source: The <emphasis>Bulk Renamers</emphasis> can be applied to the name of the files, the suffix of the files or both to the name and the suffix of the files. <application>Thunar</application> currently supports the following <emphasis>Bulk Renamers</emphasis>:
ru: При <emphasis>массовом переименовании</emphasis> изменения могут применяться к имени файлов, суффиксам или к имени и суффиксам одновременно. В настоящее время <application>Thunar</application> поддерживает следующие <emphasis>массовые переименования</emphasis>:

source: Remove characters.
ru: Удалить символы;

source: Numbering files.
ru: Нумерация файлов;

source: Insert Date or Time.
ru: Вставить дату или время;

source: Insert or overwrite characters.
ru: Вставить или перезаписать символы;

source: Search and replace characters.
ru: Поиск и замена символов;

source: Convert to uppercase, lowercase or camlcase.
ru: Преобразование в заглавные, прописные буквы или преобразование в формат с заглавными первыми буквами слов.

source: Additional <emphasis>Bulk Renamers</emphasis> may be installed as plugins for <application>Thunar</application>. Check the <ulink type="http" url="http://thunar.xfce.org/plugins.html">Thunar Plugins</ulink> website for currently available extensions. The <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/bulk_renamer">Thunar Project Wiki</ulink> contains further details about this feature. Feel free to add more information to the Wiki.
ru: Дополнительные утилиты <emphasis>массового переименования</emphasis> могут быть установлены в качестве дополнительных модулей для Thunar. На странице <ulink type="http" url="http://thunar.xfce.org/plugins.html">Thunar Plugins</ulink> вы можете ознакомиться с доступными дополнениями. На <ulink type="http" url="http://thunar.xfce.org/pwiki/documentation/bulk_renamer">wiki проекта Thunar</ulink> находится более подробная информация об этой возможности. Вы можете свободно добавлять информацию на wiki.

source: The UNIX File System
ru: Файловая система UNIX

source: While the Thunar file manager does a good job at abstracting the details of the underlying file system, so the user does not need to care about them, it is sometimes useful to understand the basic concepts to get the whole picture. This section tries to give a brief introduction to the concepts of the UNIX file system, which is used today by all incarnations of UNIX, including Linux.
ru: Несмотря на то, что файловый менеджер Thunar хорошо скрывает от пользователя детали функционирования файловых систем, полезно изучить принципы их работы, чтобы иметь целостное представление картины происходящего. Этот раздел является кратким введением в основные принципы работы файловой системы UNIX, использующейся в настоящее время во всех вариантах UNIX, включая Linux.

source: Folders and Paths
ru: Папки и пути

source: In a UNIX file system all folders are arranged in a simple inverted tree structure descending and branching down from a single top level folder, which is called the <emphasis>root directory</emphasis> (the term <emphasis>directory</emphasis> is often used instead of <emphasis>folder</emphasis>) and displayed as <guilabel>File System</guilabel> in Thunar. This means that you can get from any folder to any other by going up the tree until you reach a common point, then down the tree through the appropriate subfolders until you reach your target.
ru: В файловой системе UNIX все папки организованы в простую древовидную структуру. Основой этой структуры является папка, именуемая <emphasis>корневой каталог</emphasis> (термин <emphasis>каталог</emphasis> часто используется вместо термина <emphasis>папка</emphasis>) и отображается в Thunar как <guilabel>Файловая система</guilabel>. Это значит, что вы можете попасть из одной папки в другую, просто перемещаясь по дереву файловой системы вверх (пока не достигнете общей точки) и вниз по подкаталогам до вашей цели.

source: The position of any file or folder in the tree can be described by its <emphasis>path</emphasis>. The path is the list of folders you would have to descend through to get to the target folder or file, starting from the top level folder. For example <filename role="directory">/home/luke</filename> is the subfolder <filename role="directory">luke</filename> of the subfolder <filename role="directory">home</filename> of the top level folder, and <filename>/home/luke/myfile.txt</filename> is the file <filename>myfile.txt</filename> in that subfolder. The leading <filename role="directory">/</filename> in these paths represents the top level folder.
ru: Позиция любого файла и любой папки в дереве файловой системы описывается термином <emphasis>путь</emphasis>. Путь — это список папок, через которые вы должны пройти, чтобы добраться от корня файловой системы до нужной папки или файла. Например, <filename role="directory">/home/luke</filename> — это подпапка <filename role="directory">luke</filename> подпапки <filename role="directory">home</filename>, расположенной в корневой папке, а <filename>/home/luke/myfile.txt</filename> — это файл <filename>myfile.txt</filename> в этой подпапке. Ведущий <filename role="directory">/</filename> в этих путях обозначает корневую папку файловой системы.

source: Every user has their own folder to hold their personal files and settings. This folder is called the <emphasis>home directory</emphasis> and is displayed in Thunar as special icon with the users login name. The folder is similar to the <guilabel>My Files</guilabel> folder known from Windows. The <emphasis>home directories</emphasis> of the various users in a system are usually located below the <filename role="directory">/home</filename> folder. For example <filename role="directory">/home/luke</filename> would be the home directory of the user with the login name <filename role="directory">luke</filename>, while <filename role="directory">/home/jane</filename> would be the home directory for the user with the login name <filename role="directory">jane</filename>.
ru: Каждый пользователь имеет свою собственную папку для хранения файлов и настроек. Эта папка называется <emphasis>домашней папкой</emphasis> и отображается в Thunar специальным значком с именем пользователя. Эта папка похожа на папку <guilabel>Мои документы</guilabel> из Windows. <emphasis>Домашние папки</emphasis> пользователей обычно располагаются в папке <filename role="directory">/home</filename>.Например, папка <filename role="directory">/home/luke</filename> будет домашней папкой пользователя с именем <filename role="directory">luke</filename>, а папка <filename role="directory">/home/jane</filename> будет домашней папкой пользователя с именем <filename role="directory">jane</filename>.

source: File Types
ru: Типы файлов

source: You may have already heard that everything is a file in UNIX. This is true for most objects present in UNIX systems today. In fact even devices are represented as a special files. While this may not make sense at first sight, it is one of the strengths of UNIX and its derivates, and has helped it to maintain a simple core over the years where other operating systems had to introduce new concepts for every new technology.
ru: Наверное вы уже знаете, что в UNIX всё является файлом. Это справедливо для большинства объектов в современных системах UNIX. Даже устройства представлены в виде специальных файлов. Хотя на первый взгляд это может показаться бессмысленным, но именно данная особенность является одной из наиболее сильных сторон UNIX и его производных. Это помогло сохранить простое ядро в течение многих лет, в то время как другие операционные системы должны привносить новые концепции для каждой новой технологии.

source: These are the four most important types of files in the UNIX file system.
ru: В файловой системе UNIX существует четыре наиболее важных типа файлов.

source: Ordinary Files
ru: Обычные файлы

source: An ordinary file may contain text, a program or other data. This includes image files, audio files, office documents and video files. The term <emphasis>file</emphasis> is often used to refer to an ordinary file.
ru: Обычный файл может содержать текст, программу или другие данные. Это относится к файлам изображений, аудиофайлам, офисным документам и видеофайлам. Термин <emphasis>файл</emphasis> часто используется для обозначения именно обычных файлов.

source: Folder Files
ru: Папки

source: Folders are also files in the UNIX file system. To be exact a folder is a special file, which contains a mapping of file names to file references for every file contained within this folder.
ru: Папки в файловой системе UNIX тоже являются файлами. Точнее, папка — это специальный файл, который содержит имена файлов и соответствующие ссылки для всех файлов в этой папке.

source: Symbolic Link Files
ru: Файлы символических ссылок

source: A Symbolic link (often called a <emphasis>symlink</emphasis>) is a special file that contains a path to another file in the file system. Symbolic link files therefore do not contain any useful information themselves, but just refer to other files.
ru: Символическая ссылка (часто называемая <emphasis>симлинк</emphasis>) — это специальный файл, содержащий путь к другому файлу в файловой системе. Таким образом, символическая ссылка не содержит сама по себе никакой полезной информации, а просто ссылается на другие файлы.

source: Device Files
ru: Файлы устройств

source: As mentioned earlier (most) devices are also accessed through the file system. These special device files are usually located in the <filename role="directory">/dev</filename> folder. For example the special file <filename>/dev/hda</filename> represents the first IDE disk on Linux.
ru: Как упоминалось ранее, доступ к большинству устройств тоже осуществляется через файловую систему. Эти специальные файлы устройств обычно находятся в папке <filename role="directory">/dev</filename>. Например, специальный файл <filename>/dev/hda</filename> соответствует в Linux первому IDE диску.

source: Frequently Asked Questions
ru: Часто задаваемые вопросы

source: The intent of this section is to collect the quite numerous frequently asked questions that relate to working with Thunar. If you know of a question that is missing from this page, please <ulink type="http" url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">file a request</ulink>.
ru: Этот раздел является собранием большого количества часто задаваемых вопросов по работе с Thunar. Если вам известен вопрос, отсутствующий на этой странице, пожалуйста <ulink type="http" url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">отправьте запрос</ulink>.

source: Why doesn't Thunar execute files marked as executable?
ru: Почему Thunar не запускает файлы, помеченные как исполняемые?

source: For security reasons Thunar only executes files of type <literal>application/x-desktop</literal>, <literal>application/x-executable</literal> and <literal>application/x-shellscript</literal>. For desktop files the execution feature will only be enabled if the desktop file is of type <literal>Application</literal> and a valid <literal>Exec</literal> line is given or of type <literal>Link</literal> and a valid <literal>URL</literal> is given. For the other types the feature is available if the file is marked executable for the current user.
ru: По соображениям безопасности Thunar запускает только файлы типа: <literal>application/x-desktop</literal>, <literal>application/x-executable</literal> и <literal>application/x-shellscript</literal>. Для файлов .desktop функция запуска включена только для файлов типа <literal>Application</literal> с корректной строкой <literal>Exec</literal> или типа <literal>Link</literal> с корректной строкой <literal>URL</literal>. Для остальных типов файлов функция доступна, если для текущего пользователя файл помечен как исполняемый.

source: Also note that for <literal>application/x-executable</literal> and <literal>application/x-shellscript</literal>, the types of the file don't really need to match these types exactly, but it is suffice if the detected type has a parent that matches one of the two types listed above, or if the MIME-type is an alias for one of the above.
ru: Обратите внимание на то, что для <literal>application/x-executable</literal> и <literal>application/x-shellscript</literal> тип файла не обязательно должен точно соответствовать этим типам, а достаточно, чтобы определённый тип имел родителя, который соответствует одному из двух вышеперечисленных типов, или же, чтобы его MIME-тип был псевдонимом для одного из них

source: Where does Thunar store the metadata associated with files?
ru: Где Thunar хранит метаданные, связанные с файлами?

source: Thunar associates various settings with files/folders, which we call metadata. This metadata for all files is stored in tdb database file, which is called the metafile. The database file is stored in <filename>$XDG_CACHE_HOME/Thunar/metafile.tdb</filename> and can be examined using the <command>tdbtool</command>, which is part of the Thunar distribution (located in the <filename role="directory">tdb/</filename> subdirectory).
ru: С файлами и папками Thunar связывает различные настройки, которые можно назвать метаданными. Такие метаданные для всех файлов хранятся в файле базы данных tdb, называемом метафайл. Файл базы данных хранится в <filename>$XDG_CACHE_HOME/Thunar/metafile.tdb</filename> и может быть открыт утилитой <command>tdbtool</command>, которая поставляется вместе с Thunar (расположена в подпапке <filename role="directory">tdb/</filename>).

source: Where does Thunar store its preferences?
ru: Где Thunar хранит свои настройки?

source: Thunar stores the user configurable preferences (and hidden settings) in an <filename>.ini</filename> file, which is located at <filename>$XDG_CONFIG_HOME/Thunar/thunarrc</filename> and can be examined using a text editor. See <filename>docs/README.thunarrc</filename> for an overview of the various preferences.
ru: Thunar хранит пользовательские (и скрытые) настройки в файле <filename>.ini</filename>, расположенном в <filename>$XDG_CONFIG_HOME/Thunar/thunarrc</filename>. Этот файл может быть открыт в текстовом редакторе. Обзор доступных для использования настроек содержится в файле <filename>docs/README.thunarrc</filename>.

source: How to use mouse gestures in Thunar?
ru: Как использовать жесты мыши в Thunar?

source: Thunar currently features basic support for so called <emphasis>mouse gestures</emphasis> in its icon view. You can use these <emphasis>mouse gestures</emphasis> by holding down the middle mouse button (usually the mouse wheel) while the mouse pointer is on the background area of the icon view component (any area that is not covered by an icon or a text). Now you can move the cursor into four directions to perform certain actions, which are described below.
ru: В Thunar существует базовая поддержка так называемых <emphasis>жестов мыши</emphasis> в режиме просмотра в виде значков. Вы можете воспользоваться <emphasis>жестами мыши</emphasis>, нажав среднюю кнопку мыши (обычно это колёсико), когда курсор мыши располагается в основной области (но не над областью, закрытой значками или текстом). Теперь вы можете перемещать курсор в одном из четырёх направлений для выполнения действий, описанных ниже:

source: Left
ru: Влево

source: <placeholder-1/> - opens the previous visited folder
ru: <placeholder-1/> — открывает последнюю посещённую папку;

source: Up
ru: Вверх

source: <placeholder-1/> - opens the parent folder
ru: <placeholder-1/> — открывает родительскую папку;

source: Right
ru: Вправо

source: <placeholder-1/> - opens the next visited folder
ru: <placeholder-1/> — открывает следующую папку;

source: Down
ru: Вниз

source: <placeholder-1/> - reloads the current folder
ru: <placeholder-1/> — обновляет текущую папку.

source: How do I assign different keyboard shortcuts?
ru: Как я могу назначить горячие клавиши (ускорители)?

source: If you want to rebind a shortcut, Thunar supports the standard GTK+ way of changing shortcuts: simply hover over the menu option with the mouse pointer and press the keyboard shortcut you want to rebind it to.
ru: Thunar поддерживает стандартный способ изменения «горячих клавиш» GTK+. Если вы хотите переопределить горячие клавиши (ускорители), наведите указатель мыши на нужный пункт меню и нажмите комбинацию клавиш, которую вы желаете использовать.

source: To delete a keyboard assignment, press the <keycap>Backspace</keycap> key while you are on the menu entry.
ru: Для удаления комбинации клавиш, наведите указатель мыши на пункт меню и нажмите <keycap>Backspace</keycap>.

source: If the shortcut doesn't change, then you need to enable the feature in GTK+. This can be achieved in 3 ways:
ru: Если комбинация клавиш не изменяется, вы должны включить эту возможность в GTK+. Сделать это можно тремя способами:

source: If you are running Xfce 4.3 or above then you can enable <guilabel>Editable menu accelerators</guilabel> in the <guilabel>User Interface Preferences</guilabel> dialog.
ru: Если вы используете Xfce версии 4.3 или новее, вы можете выбрать <guilabel>Включить редактируемые ускорители</guilabel> в диалоге <guilabel>Внешний вид</guilabel>;

source: If you are running GNOME then you can enable <guilabel>Editable menu accelerators</guilabel> in the <guilabel>Menu and Toolbars</guilabel> control center dialog.
ru: Если вы используете GNOME, вы можете включить <guilabel>Включить редактируемые ускорители</guilabel> в диалоге центра управления <guilabel>Меню и панели инструментов</guilabel>;

source: Otherwise put the following in your <filename>~/.gtkrc-2.0</filename> file (create the file if it doesn't exist):<screen>gtk-can-change-accels=1</screen>
ru: В остальных случаях добавьте следующую запись в ваш <filename>~/.gtkrc-2.0</filename> файл (создайте этот файл, если он отсутствует):<screen>gtk-can-change-accels=1</screen>

source: Where does Thunar store the keyboard shortcuts?
ru: Где Thunar хранит настройки горячих клавиш?
