Repository: AKJUS/thunar
Catalog: docs/manual/po/*.po
Languages: ru

source: However this notification will only be displayed if support for <application>libnotify</application> is enabled, and you have installed a notification daemon. A notification daemon for Xfce is available from the <ulink type="http" url="http://goodies.xfce.org/projects/applications/notification-daemon-xfce">Xfce Goodies Project</ulink>. If notification support is not available, wait until the context menu disappears before you remove the media or disconnect the drive.
ru: Это сообщение выводится только тогда, когда включена поддержка <application>libnotify</application> и у вас установлена и запущена служба оповещений. Служба оповещений для Xfce доступна на <ulink type="http" url="http://goodies.xfce.org/projects/applications/notification-daemon-xfce">Xfce Goodies Project</ulink>. Если поддержка оповещений не доступна, то прежде чем отсоединять устройство, дождитесь пока контекстное меню исчезнет.

source: Be aware that you cannot eject or unmount media that is still in use by one or more applications. Therefore if the file manager refuses to eject media, make sure you close all applications that were accessing the media, and be sure to also check command line applications running in <application>Terminal</application> windows.
ru: Обратите особое внимание на то, что вы не можете извлечь или отсоединить носитель, пока он используется одним или несколькими приложениями. Таким образом, если файловый менеджер не может извлечь носитель, удостоверьтесь, что вы закрыли все приложения, работающие с этим носителем, а также проверьте терминальные приложения, работающие в окне <application>Terminal</application>.

source: Make sure to unmount removable media before ejecting. Do not eject a diskette from the floppy drive before your unmount the diskette. Do not remove an USB stick before you unmount the flash drive. If you do not unmount the media first you might lose data or cause your system to crash.
ru: Удостоверьтесь в том, что вы отключили носитель перед его извлечением. Не вынимайте дискету из дисковода, не отключив её. Не отсоединяйте USB-накопитель прежде, чем вы отключили USB устройство. Если вы не отключите накопитель, это может быть чревато потерей данных и сбоями в системе.

source: Management of Removable Drives and Media
ru: Управление съёмными устройствами и носителями данных

source: Thunar is also able to automatically manage removable drives and media if the <ulink type="http" url="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html">thunar-volman</ulink> package is installed on your system. Note however that this feature requires HAL support.
ru: Thunar может автоматически управлять съёмными устройствами и носителями, если в системе установлен пакет <ulink type="http" url="http://www.foo-projects.org/~benny/projects/thunar-volman/index.html">thunar-volman</ulink>. Также для этого необходима поддержка HAL.

source: Now, if HAL support is available and <application>thunar-volman</application> is installed on your system, you can choose to enable the <guilabel>Volume Management</guilabel> feature of Thunar. Therefore, open the file manager preferences, go to the <guilabel>Advanced</guilabel> page and check the <guilabel>Enable Volume Management</guilabel> button.
ru: При наличии поддержки HAL и установленном в системе <application>thunar-volman</application> вы можете включить в Thunar <guilabel>Управление томами</guilabel>. Для этого откройте настройки файлового менеджера, далее выберите вкладку <guilabel>Дополнительно</guilabel> и выберите <guilabel>Включить управление томами</guilabel>.

source: The next step is to customize the management of removable drives and media to your needs. Click on the <guilabel>Configure</guilabel> link in the <guilabel>Volume Management</guilabel> section, right below the button. The <guilabel>Removable Drives and Media</guilabel> configuration dialog will be displayed.
ru: Следующим шагом является настройка управления съёмными устройствами и носителями в соответствии с вашими требованиями. Щёлкните по ссылке <guilabel>Настроить</guilabel> в разделе <guilabel>Управление томами</guilabel>. Покажется диалоговое окно <guilabel>Съёмные устройства и носители данных</guilabel>.

source: Removable Drives and Media
ru: Съёмные устройства и носители данных

source: If you have used the <application>gnome-volume-manager</application> previously, you should feel right at home, because it was designed to look and behave similar to <application>gnome-volume-manager</application>. The preferences are divided by device categories to make it easy to locate the option for you specific device.
ru: Если вы когда-то уже использовали <application>gnome-volume-manager</application>, то вы не будете испытывать неудобств, потому что его внешний вид и поведение схожи с <application>gnome-volume-manager</application>. Для облегчения поиска настроек, относящихся именно к нужному устройству, настройки разделены по видам устройств.

source: The <guilabel>Storage</guilabel> page contains the most important options. As the name suggests these options apply only to storage devices like external harddisk drives, USB sticks and CD-ROMs. The <guilabel>Removable Storage</guilabel> options are described in detail below.
ru: Вкладка <guilabel>Накопители</guilabel> содержит наиболее важные настройки. Как подсказывает название, эти настройки относятся только к съёмным устройствам, таким как: внешние жёсткие диски, USB-накопители и CD-ROM диски. Настройки раздела <guilabel>Съёмные накопители</guilabel> детально описаны ниже.

source: Mount removable drives when hot-plugged
ru: Подключать обнаруженные съёмные устройства

source: Enable this option to automatically mount file systems on removable drives (i.e. external harddisk drives or USB sticks) when such drives are plugged into the computer.
ru: Включение этой опции приводит к автоматическому подключению съёмных устройств (например, жёстких дисков или USB-накопителей) при их подсоединении к компьютеру.

source: This option must be enabled for certain other features to work with removable drives. For example, if you disable this option, certain kinds of portable music players cannot be detected any more and so, even if you enabled the <guilabel>Play music files when connected</guilabel> option on the <guilabel>Multimedia</guilabel> page, the specified command will not be run when you hot-plug your portable music player.
ru: Включение этой опции необходимо для задействования ряда возможностей при работе со съёмными носителями. Например, если вы отключите эту опцию, то у вас не будут распознаваться некоторые типы музыкальных проигрывателей. Заданная команда не будет выполняться при подключении переносного музыкального проигрывателя, даже при включённой опции <guilabel>Проигрывать файлы с музыкой при подключении плеера</guilabel> на вкладке <guilabel>Мультимедиа</guilabel>.

source: Mount removable media when inserted
ru: Подключать вставленные съёмные носители

source: Enable this option to automatically mount file systems on removable media (i.e. CD-ROMs or DVDs) when you insert the media into the drive.
ru: Включение этой опции приводит к автоматическому подключению файловой системы съёмных носителей (например, CD-ROM или DVD) при вставке носителей в устройство.

source: This option must be enabled for certain other features to work with removable media. For example, if you disable this option, it is impossible to detect whether the removable media has auto-run capabilities, and so the <guilabel>Auto-run programs on new drives and media</guilabel> option has no effect for removable media.
ru: Включение этой опции необходимо для задействования ряда возможностей при работе со съёмными носителями. Например, если вы отключите эту опцию, то станет невозможно распознать, имеет ли съёмный носитель возможность автозапуска. Таким образом, для съёмных носителей опция <guilabel>Автоматически запускать программы с новых устройств и носителей</guilabel> не будет иметь никакого эффекта.

source: Browse removable media when inserted
ru: Просматривать вставленный съёмный носитель в файловом менеджере

source: Enable this option to automatically display the content of newly inserted media in the file manager. Note however, that the contents will only be displayed if no other action was possible or you choose to ignore the other possible actions. For example, if you insert a CD-ROM with auto-run capabilities and the <guilabel>Auto-run programs on new drives and media</guilabel> option is enabled, you will be prompted whether you want to allow or ignore the auto-run. If you choose to ignore the auto-run the contents will be displayed in the file manager.
ru: Включение этой опции приводит к автоматическому показу содержимого только что вставленного съёмного носителя в файловом менеджере. Однако содержимое будет показано только в том случае, если не применимы никакие другие действия или вы отключили все возможные дополнительные действия. Например, если вы вставили CD-ROM с функцией автозапуска и у вас включена опция <guilabel>Автоматически запускать программы с новых устройств и носителей</guilabel>, будет выведен запрос, хотите ли вы воспользоваться функцией автозапуска или проигнорировать её. Если вы выберете проигнорировать, то содержимое будет отображено в файловом менеджере.

source: Auto-run programs on new drives and media
ru: Автоматически запускать программы с новых устройств и носителей

source: Enable this option to make use of auto-run capabilities of certain removable drives and media. See the <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> for details about the auto-run mechanism. To enhance security, you will always be prompted to confirm the auto-run.
ru: Включение этой опции позволяет использовать функцию автозапуска, доступную для некоторых типов съёмных носителей. Ознакомьтесь со спецификацией <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> для получения детальной информации о механизме автозапуска. В целях повышения безопасности запрос о подтверждении автозапуска появляется всегда.

source: If the Windows emulator <ulink type="http" url="http://www.winehq.org/">WINE</ulink> is installed on your system, the auto-run mechanism will also try to run <filename>autorun.exe</filename> files using WINE.
ru: Если в вашей системе установлен эмулятор Windows <ulink type="http" url="http://www.winehq.org/">WINE</ulink>, то функция автозапуска попытается выполнить файлы <filename>autorun.exe</filename>, используя WINE.

source: Auto-open files on new drives and media
ru: Автоматически открывать файлы с новых устройств и носителей

source: Enable this option to make of auto-open capabilities of certain removable drives and media. See the <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> for details about the auto-open mechanism. To enhance security, you will always be prompted to confirm the auto-open.
ru: Включение этой опции позволяет настроить функцию автооткрытия, доступную для некоторых устройств и носителей. Ознакомьтесь со спецификацией <ulink type="http" url="http://standards.freedesktop.org/autostart-spec/autostart-spec-0.5.html">Desktop Application Autostart Specification</ulink> для получения детальной информации о механизме автооткрытия. В целях повышения безопасности запрос о подтверждении автооткрытия появляется всегда.

source: The remaining options allow you to specify a command to run when a certain kind of media is inserted into a drive or a certain kind of external device is connected. The command can use three special variables, that will be substituted when the command is run:
ru: Оставшиеся опции позволяют вам задать команду, которая должна выполняться при появлении накопителя в устройстве или при подключении какого-то внешнего устройства. В команде можно использовать три специальные переменные, которые будут подменяться во время выполнения команды:

source: Each appearance of <literal>%d</literal> in the command will be substituted with the device file path of the newly added device. For example, if you have plugged in an USB stick, the device file path will be <filename>/dev/da0s1</filename> or <filename>/dev/sda1</filename>.
ru: Каждое появление <literal>%d</literal> в строке команды будет замещено путём к файлу нового подключённого устройства. Например, если вы подключили USB-накопитель, путём к файлу устройства будет <filename>/dev/da0s1</filename> или <filename>/dev/sda1</filename>.

source: If no device file is associated with the device or the device file could not be found for some reason, the variable <literal>%d</literal> will be substituted with the empty string.
ru: Если с устройством не связан никакой файл устройства, либо устройство по каким-то причинам не обнаруживается, переменная <literal>%d</literal> будет заменяться пустой строкой.

source: Each appearance of <literal>%h</literal> in the command will be substituted with the HAL UDI of the newly added device.
ru: Каждое появление <literal>%h</literal> в строке команды будет замещено на HAL UDI нового подключённого устройства.

source: Each appearance of <literal>%m</literal> in the command will be substituted with the mount point where the newly added device was mounted. If the device cannot be mounted (for example printers or keyboards) or if the automatic mounting was disabled, <literal>%m</literal> will be substituted with the empty string.
ru: Каждое появление <literal>%m</literal> в строке команды будет замещено на точку подключения нового устройства. Если устройство не может быть подключено (например, принтер или клавиатура), либо при отключённом автоматическом подключении, <literal>%m</literal> будет заменяться пустой строкой.

source: Troubleshooting the Volume Manager
ru: Поиск и устранение неисправностей при управлении томами

source: Useful tips to trouble shoot the volume manager in case it does not work as expected.
ru: Полезные советы для обнаружения и устранения неисправностей при управлении томами:

source: Make sure <application>Thunar</application> is running as daemon. The volume manager depends on this, as it is not a daemon by itself. By default, Xfce automatically spawns <application>Thunar</application> as daemon on startup. If it got killed for some reason, open the <guilabel>Run program</guilabel> (using the keyboard shortcut <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> or right-click on the desktop and choose <guilabel>Run Program...</guilabel> from the desktop menu), enter <literal>Thunar --daemon</literal> and click <guibutton>Run</guibutton>.
ru: Убедитесь, что <application>Thunar</application> запущен как служба. Это необходимо для функции управления томами, которая сама по себе службой не является. По умолчанию Xfce при старте автоматически запускает <application>Thunar</application> как службу. Если по какой-либо причине <application>Thunar</application> был закрыт, откройте <guilabel>Выполнить...</guilabel> (используя сочетание клавиш <keycombo><keycap>Alt</keycap><keycap>F2</keycap></keycombo> или щёлкните правой кнопкой мыши по рабочему столу и выберите в меню <guilabel>Запуск программы</guilabel>), введите <literal>Thunar --daemon</literal> и щёлкните <guibutton>Выполнить...</guibutton>;

source: Try running <application>thunar-volman</application> from a <application>Terminal</application> window after hot-plugging the drive or inserting the media. First, you need to figure out the HAL UDI of the new device using <application>lshal</application> or <application>hal-device</application>. Once you know the UDI, run <literal>thunar-volman --device-added &lt;udi-of-your-device&gt;</literal> in a <application>Terminal</application> window and watch the output for errors or warnings.
ru: Попробуйте запустить <application>thunar-volman</application> из окна <application>Terminal</application> после подключения устройства или вставки носителя. Во-первых, вам необходимо выяснить HAL UDI нового устройства, используя <application>lshal</application> или <application>hal-device</application>. После того, как вы узнаете UDI, выполните <literal>thunar-volman --device-added &lt;udi-of-your-device&gt;</literal> в окне <application>Terminal</application> и проверьте вывод на наличие ошибок и предупреждений.

source: If it still refuses to work, ask on the <ulink type="http" url="http://forum.xfce.org/">Xfce Forum</ulink> or the <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-dev mailing list</ulink> for help.
ru: Если устройство по-прежнему не работает, обратитесь за помощью на <ulink type="http" url="http://forum.xfce.org/">форум Xfce</ulink> или в <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">список рассылки thunar-dev</ulink>.

source: File Management Preferences
ru: Настройки файлового менеджера

source: Use the <guilabel>File Manager Preferences</guilabel> dialog to set your <application>Thunar</application> file manager preferences. To open the preferences dialog, choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Preferences...</guimenuitem></menuchoice> from the menu bar, or click on the <guibutton>File Manager</guibutton> button in the Xfce Settings Manager.
ru: Для настройки файлового менеджера <application>Thunar</application> воспользуйтесь диалоговым окном <guilabel>Настройки файлового менеджера</guilabel>. Для запуска окна диалога настройки выберите в меню <menuchoice><guimenu>Правка</guimenu><guimenuitem>Параметры...</guimenuitem></menuchoice> или щёлкните на кнопку <guibutton>Файловый менеджер</guibutton> в Диспетчере настроек Xfce.

source: The <guilabel>File Manager Preferences</guilabel> dialog is divided into four pages with different options, each described in a separate section below. Basically you can set preferences in the following categories:
ru: Окно <guilabel>Настройки файлового менеджера</guilabel> разделено на четыре вкладки с различными настройками, каждая из которых будет описана в отдельном разделе ниже. В основном вы можете производить настройки в следующих категориях:

source: The default settings for the views.
ru: Настройки отображения;

source: The default settings for the side pane.
ru: Настройки боковой панели;

source: The behavior of the file manager windows.
ru: Настройки поведения окон;

source: Advanced features of the file manager.
ru: Дополнительные настройки.

source: Thunar also supports a bunch of so-called <emphasis>Hidden Options</emphasis>, which control several advanced features of the file manager, but are not included in the preferences in order to keep the preferences dialog simple. The <ulink type="http" url="http://svn.xfce.org/svn/xfce/thunar/trunk/docs/README.thunarrc"><filename>README.thunarrc</filename></ulink> file that is included with the Thunar distribution describes all available options in detail.
ru: Также Thunar поддерживает множество так называемых <emphasis>скрытых настроек</emphasis>, которые управляют рядом дополнительных возможностей файлового менеджера, но не включены в диалог настройки для того, чтобы не перегружать его. Файл <ulink type="http" url="http://git.xfce.org/xfce/thunar/tree/docs/README.thunarrc"><filename>README.thunarrc</filename></ulink>, включённый в дистрибутив Thunar, подробно описывает все возможные параметры.

source: Views Preferences
ru: Настройки отображения

source: You can specify a default view, select sort options and display options. You can also specify whether thumbnails should be displayed for file types that support this.
ru: В этой вкладке вы можете задать режим просмотра по умолчанию, выбрать способ сортировки и параметры отображения. Также вы можете выбрать, отображать ли образцы файлов (эскизы, иллюстрирующие содержимое файла) для тех типов файлов, которые поддерживают эту возможность.

source: View new folder using
ru: Просматривать новые папки, используя

source: Select the default view for folders. When you open a new window, the is displayed in the view that you select. This can be either the icon view, the compact list view or the detailed list view. You can also select <guilabel>Last Active View</guilabel> here to use the view you used for the last active window.
ru: Выберите режим просмотра по умолчанию для папок. Когда вы открываете новое окно, оно будет отображается в соответствии с выбранным режимом просмотра. Существуют режимы просмотра в виде значков, в виде подробного или компактного списка. Также вы можете выбрать <guilabel>Последний активный режим просмотра</guilabel> для того, чтобы использовать режим просмотра как у последнего активного окна.

source: Sort folders before files
ru: Отображать папки перед файлами

source: Select this option to list folders before files when you sort a folder.
ru: Выберите эту опцию для отображения папок перед файлами при сортировке содержимого папки.

source: Show thumbnails
ru: Показывать образцы файлов

source: Select this option to show thumbnails of image files and other supported files. The file manager stores the thumbnail files for each folder in the hidden <filename role="directory">.thumbnails</filename> directory in the user's Home Folder.
ru: Выберите эту опцию для того, чтобы показывались образцы файлов (эскизы, иллюстрирующие содержимое файла) для графических или других поддерживаемых типов файлов. Файловый менеджер сохраняет образцы файлов для каждой папки в скрытой папке <filename role="directory">.thumbnails</filename> в домашней папке пользователя.

source: See <xref linkend="thumbnailers"/> if you want to extend the basic thumbnail functionality provided by <application>Thunar</application> with support for additional file types.
ru: Если вы хотите расширить базовые возможности, предоставляемые <application>Thunar</application>, возможностью работы с дополнительными типами файлов, обратитесь к разделу <xref linkend="thumbnailers"/>,

source: Text beside icons
ru: Текст рядом со значками

source: Select this options to place the icon captions for items in the icon view beside the icon rather than under the icon.
ru: Выберите эту опцию, чтобы в режиме просмотре в виде значков подпись к значку располагалась рядом со значком, а не под ним.

source: Side Pane Preferences
ru: Настройки боковой панели

source: You can select display options for the shortcuts pane and the tree pane.
ru: Вы можете настроить отображение содержимого боковой панели в виде закладок и дерева.

source: The side pane can either display a list of shortcuts for folders in your file system, which is the default, or a tree view of your file system. This page allows you to select the size of the icons for the shortcuts and the tree pane. You can also specify whether emblems should be displayed.
ru: Боковая панель может отображать либо список закладок для папок в вашей файловой системе (по умолчанию), либо древовидное представление вашей файловой системы. Данная вкладка позволяет вам выбрать размер значков для списка закладок и для дерева. Также вы можете указать, должны ли отображаться эмблемы значков.

source: Icon Size
ru: Размер значков

source: The size of the icons displayed in the side, ranging from <guilabel>Very Small</guilabel> (around 16x16 pixels) to <guilabel>Very Large</guilabel> (around 128x128 pixels).
ru: Размер значков, отображаемых сбоку, можно изменять от <guilabel>Крошечных</guilabel> (около 16x16 пикселей) до <guilabel>Очень больших</guilabel> (около 128x128 пикселей).

source: Show Icon Emblems
ru: Показывать эмблемы значков
