Repository: AKJUS/thunar
Catalog: docs/manual/po/*.po
Languages: ru

source: The custom keyboard shortcuts are stored in the standard GTK+ accel map format in a file located at <filename>$XDG_CONFIG_HOME/Thunar/accels.scm</filename>. Lines starting with <literal>;</literal> are comments. See the GTK+ documentation for details about the file format.
ru: Пользовательские горячие клавиши хранятся в файле <filename>$XDG_CONFIG_HOME/Thunar/accels.scm</filename> в стандартном формате accel map GTK+. Строки, начинающиеся с <literal>;</literal> являются комментариями. За детальной информацией о формате файла обращайтесь к документации GTK+.

source: If you are a packager or a system administrator and want to provide a system wide default for the keyboard shortcuts, that is different from the default shortcuts in Thunar, you can create a file <filename>Thunar/accels.scm</filename> in one of the <envar>$XDG_CONFIG_DIRS</envar>. For example, if <filename role="directory">/etc/xdg</filename> is part of <envar>$XDG_CONFIG_DIRS</envar> (the default for most Linux distributions), you can install system wide defaults to <filename>/etc/xdg/Thunar/accels.scm</filename>. Thunar will then load shortcuts from this file on first startup.
ru: Если вы разработчик пакетов приложений или системный администратор и хотите задать общесистемный набор для комбинаций клавиш, отличающийся от стандартных в Thunar, вы можете создать файл <filename>Thunar/accels.scm</filename> в одном из каталогов <envar>$XDG_CONFIG_DIRS</envar>. Например, если <filename role="directory">/etc/xdg</filename> входит в <envar>$XDG_CONFIG_DIRS</envar> (что является стандартом для большинства Linux дистрибутивов), вы можете создать файл <filename>/etc/xdg/Thunar/accels.scm</filename>. После этого Thunar будет загружать комбинации клавиш из этого файла при первом запуске.

source: Support
ru: Поддержка

source: To report a bug or to make a suggestion regarding this application or this manual, use the bug tracking system at <ulink url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">http://bugzilla.xfce.org/</ulink>. Remember that useful bug reports are ones that get bugs fixed, so a useful bug report has two qualities:
ru: Чтобы сообщить об ошибке или внести предложение, относящееся к этой программе или данному руководству, используйте систему отслеживания ошибок <ulink url="http://bugzilla.xfce.org/enter_bug.cgi?product=Thunar&amp;format=guided">http://bugzilla.xfce.org/</ulink>. Помните, что хорошее сообщение об ошибке приводит к её исправлению. Хорошее сообщение об ошибке обладает двумя качествами:

source: <emphasis role="bold">Reproducible.</emphasis> If the developer cannot see the bug himself to prove that it exists, he will most probably not be able to fix it at all. Every detail you can provide helps.
ru: <emphasis role="bold">Воспроизводимость.</emphasis> Если разработчик сам не сможет увидеть ошибку и убедиться в её существовании, он, скорее всего, вообще не сможет её исправить. Поэтому поможет любая деталь, которую вы сможете сообщить.

source: <emphasis role="bold">Specific.</emphasis> The quicker the developer can isolate the problem to a specific area, the more likely he will expediently fix it.
ru: <emphasis role="bold">Точность.</emphasis> Чем быстрее разработчик сможет отнести проблему к определённой области, тем больше шанс того, что проблема будет исправлена наилучшим образом.

source: In case you want to request a new feature, please make clear why you consider it a worth addition for the application. It is more likely that a new feature gets added if you provide good arguments for the feature. It will increase the chance of addition even more if you provide a patch that implements the requested feature, but make sure that you read the file <ulink type="http" url="http://svn.xfce.org/svn/xfce/terminal/trunk/HACKING">HACKING</ulink> - especially the section labeled <emphasis>Coding Style</emphasis> - before you start hacking up the source.
ru: В случае, если вы хотите предложить добавление какой-то новой функции, пожалуйста, чётко сформулируйте, почему вы считаете её ценным дополнением к приложению. Если вы представите хорошие аргументы в её пользу, то будет больше шансов, что новая функция в действительности будет добавлена. Вероятность возрастает ещё больше, если вы предоставите патч, реализующий желаемое изменение. Однако, прежде чем вносить изменения в исходный код, прочтите файл <ulink type="http" url="http://svn.xfce.org/svn/xfce/terminal/trunk/HACKING">HACKING</ulink>. Особенно обратите внимание на раздел под заголовком <emphasis>Coding Style</emphasis>.

source: Else, if you have questions about the use or installation of this software, please ask on the <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">thunar-dev mailing list</ulink> or point your IRC client to <emphasis role="bold">irc.freenode.net</emphasis>, join the channel <emphasis role="bold">#thunar</emphasis> and ask for help.
ru: В случае, если у вас есть вопросы по использованию или установке этого программного обеспечения, пожалуйста, задайте их в <ulink type="http" url="http://foo-projects.org/mailman/listinfo/thunar-dev">списке рассылки thunar-dev</ulink>, либо настройте свой IRC клиент на <emphasis role="bold">irc.freenode.net</emphasis> и подключитесь к каналу <emphasis role="bold">#thunar</emphasis> для получения помощи.

source: About @PACKAGE_NAME@
ru: О @PACKAGE_NAME@

source: @PACKAGE_NAME@ was written by Benedikt Meurer (<email>benny@xfce.org</email>). Visit the <ulink url="http://thunar.xfce.org/" type="http">Thunar website</ulink> for more information.
ru: @PACKAGE_NAME@ написал Benedikt Meurer (<email>benny@xfce.org</email>). Посетите <ulink url="http://thunar.xfce.org/" type="http">сайт Thunar</ulink> для получения более подробной информации.

source: This documentation was written by Benedikt Meurer (<email>benny@xfce.org</email>). The latest version of this document is always available from the <ulink type="http" url="http://thunar.xfce.org/">Thunar website</ulink>.
ru: Эта документация написана Benedikt Meurer (<email>benny@xfce.org</email>). Последняя версия этого документа всегда доступна на <ulink type="http" url="http://thunar.xfce.org/">сайте Thunar</ulink>.

source: This software is distributed under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ru: Это программное обеспечение распространяется на условиях лицензии GNU General Public License, опубликованной Free Software Foundation, версии 2 или (по вашему выбору) любой более поздней версии.

source: You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
ru: Вы должны были получить копию лицензии GNU General Public License вместе с этой программой. Если это не так, напишите во Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.

source: translator-credits
ru: Andrey Fedoseev <andrey.fedoseev@gmail.com>, 2006 Maxim Zenin <webmechanics@gmail.com>, 2006 Dmitriy Smirnov <other@igus.lv>, 2010 Кабанова Елена <kea@osinit.ru>, 2010 Кабанова Ирина <kia@osinit.ru>, 2010 Денис Корявов <dkoryavov@pingwinsoft.ru>, 2010 Evgenia Sinichenkova <e.sinichenkova@gmail.com>, 2011 Alexandr Boltris <alex@altlinux.org>, 2011 Artem Zolochevskiy <artem.zolochevskiy@gmail.com>, 2011
